#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x30BC (0x341C - 0x360)
// AnimBlueprintGeneratedClass ALS_PlayerCameraBehavior_NO_OFFSET.ALS_PlayerCameraBehavior_NO_OFFSET_C
class UALS_PlayerCameraBehavior_NO_OFFSET_C : public UALSPlayerCameraBehavior
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x360(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimBlueprintGeneratedMutableData    __AnimBlueprintMutables;                           // 0x368(0xF)(HasGetValueTypeHash)
	uint8                                        Pad_3AFB[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimSubsystemInstance                AnimBlueprintExtension_PropertyAccess;             // 0x378(0x8)(None)
	struct FAnimSubsystemInstance                AnimBlueprintExtension_Base;                       // 0x380(0x8)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x388(0x20)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_4;                    // 0x3A8(0x108)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_35;                      // 0x4B0(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_34;                      // 0x5B0(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_33;                      // 0x6B0(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_32;                      // 0x7B0(0x100)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_3;                    // 0x8B0(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_10;                    // 0x9B8(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_31;                      // 0x9E0(0x100)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_9;                     // 0xAE0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0xB08(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0xB30(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0xB58(0x28)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_11;                  // 0xB80(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_10;                  // 0xBC8(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_9;                   // 0xC10(0x48)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_30;                      // 0xC58(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_29;                      // 0xD58(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_28;                      // 0xE58(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_27;                      // 0xF58(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_26;                      // 0x1058(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_25;                      // 0x1158(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_24;                      // 0x1258(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_23;                      // 0x1358(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_22;                      // 0x1458(0x100)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x1558(0x20)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_21;                      // 0x1578(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_20;                      // 0x1678(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_19;                      // 0x1778(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_18;                      // 0x1878(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_17;                      // 0x1978(0x100)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_8;                   // 0x1A78(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_7;                   // 0x1AC0(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_6;                   // 0x1B08(0x48)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_16;                      // 0x1B50(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_15;                      // 0x1C50(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_14;                      // 0x1D50(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_13;                      // 0x1E50(0x100)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x1F50(0x20)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_5;                   // 0x1F70(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_4;                   // 0x1FB8(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_3;                   // 0x2000(0x48)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_12;                      // 0x2048(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_11;                      // 0x2148(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_10;                      // 0x2248(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_9;                       // 0x2348(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_8;                       // 0x2448(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_7;                       // 0x2548(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_6;                       // 0x2648(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_5;                       // 0x2748(0x100)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_4;                       // 0x2848(0x100)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x2948(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x2968(0xC8)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_2;                    // 0x2A30(0x108)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1;                   // 0x2B38(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0x2B80(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_8;                     // 0x2C88(0x28)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_2;                   // 0x2CB0(0x48)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_3;                       // 0x2CF8(0x100)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x2DF8(0x48)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_7;                     // 0x2E40(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_6;                     // 0x2E68(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_5;                     // 0x2E90(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4;                     // 0x2EB8(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_2;                       // 0x2EE0(0x100)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x2FE0(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3;                     // 0x30E8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0x3110(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_1;                       // 0x3138(0x100)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0x3238(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0x3260(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve;                         // 0x3288(0x100)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_1;                   // 0x3388(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum;                     // 0x33D0(0x48)(None)
	float                                        Camera_Offset_Z;                                   // 0x3418(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UALS_PlayerCameraBehavior_NO_OFFSET_C* GetDefaultObj();

	void AnimGraph(struct FPoseLink* AnimGraph);
	void ExecuteUbergraph_ALS_PlayerCameraBehavior_NO_OFFSET(int32 EntryPoint);
};

}


