#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xC4 (0x350 - 0x28C)
// BlueprintGeneratedClass BP_CookingComponent.BP_CookingComponent_C
class UBP_CookingComponent_C : public UBP_MasterInventory_C
{
public:
	uint8                                        Pad_5108[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x290(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	enum class E_CookingType                     CookingType;                                       // 0x298(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_5109[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumberOfCookingSlots;                              // 0x29C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         RequireFuel;                                       // 0x2A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_510A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumberOfFuelSlots;                                 // 0x2A4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDataTableRowHandle>           FuelItems;                                         // 0x2A8(0x10)(Edit, BlueprintVisible)
	bool                                         SwitchedOn;                                        // 0x2B8(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_510B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          FuelTimer;                                         // 0x2C0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          ConvertTimer;                                      // 0x2C8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        DummySlots;                                        // 0x2D0(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_510C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FS_CookingSlot>                CookingSlots;                                      // 0x2D8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  CookingUITitle;                                    // 0x2E8(0x18)(Edit, BlueprintVisible)
	TArray<int32>                                PausedIndexs;                                      // 0x300(0x10)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	struct FS_InvItem                            ReturnFuelItem;                                    // 0x310(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<struct FS_CraftingCost>               FuelStartingItems;                                 // 0x340(0x10)(Edit, BlueprintVisible)

	static class UClass* StaticClass();
	static class UBP_CookingComponent_C* GetDefaultObj();

	void AddStartingItems(bool* Return, bool CallFunc_AddStartingItems_Return);
