#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x424 (0x6B0 - 0x28C)
// BlueprintGeneratedClass BP_EquipmentInventory.BP_EquipmentInventory_C
class UBP_EquipmentInventory_C : public UBP_MasterInventory_C
{
public:
	uint8                                        Pad_51A5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x290(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                AttachActor;                                       // 0x298(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                            OwningCharacter;                                   // 0x2A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FS_EquipmentSlot                      TacticalRigEquipmentSlot;                          // 0x2A8(0x48)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_EquipmentSlot                      GlovesEquipmentSlot;                               // 0x2F0(0x48)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_EquipmentSlot                      ShirtEquipmentSlot;                                // 0x338(0x48)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_EquipmentSlot                      BackpackEquipmentSlot;                             // 0x380(0x48)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_EquipmentSlot                      PantsEquipmentSlot;                                // 0x3C8(0x48)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_EquipmentSlot                      EyewearEquipmentSlot;                              // 0x410(0x48)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_EquipmentSlot                      ShoesEquipmentSlot;                                // 0x458(0x48)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_EquipmentSlot                      HelmetEquipmentSlot;                               // 0x4A0(0x48)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_WeaponSlot                         SecondaryWeaponSlot;                               // 0x4E8(0x4C)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                        Pad_51A6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FS_WeaponSlot                         PrimaryWeaponSlot;                                 // 0x538(0x4C)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                        Pad_51A7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FS_StartingWeaponItem>         StartingWeapons;                                   // 0x588(0x10)(Edit, BlueprintVisible)
	bool                                         UseRandomStartingWeapons;                          // 0x598(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseTotalArmour;                                    // 0x599(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_51A8[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class E_Hitbox, enum class E_EquipmentType> EquipmentDamageMapping;                            // 0x5A0(0x50)(Edit, BlueprintVisible)
	bool                                         CanDamageEffectEquipment;                          // 0x5F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_51A9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FS_StartingEquipmentItem>      StartingEquipment;                                 // 0x5F8(0x10)(Edit, BlueprintVisible)
	bool                                         UseRandomStartingEquipment;                        // 0x608(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_51AA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FDataTableRowHandle>           RandomStartingTacticalRig;                         // 0x610(0x10)(Edit, BlueprintVisible)
	TArray<struct FDataTableRowHandle>           RandomStartingGloves;                              // 0x620(0x10)(Edit, BlueprintVisible)
	TArray<struct FDataTableRowHandle>           RandomStartingShirt;                               // 0x630(0x10)(Edit, BlueprintVisible)
	TArray<struct FDataTableRowHandle>           RandomStartingBackpack;                            // 0x640(0x10)(Edit, BlueprintVisible)
	TArray<struct FDataTableRowHandle>           RandomStartingPants;                               // 0x650(0x10)(Edit, BlueprintVisible)
	TArray<struct FDataTableRowHandle>           RandomStartingEyewear;                             // 0x660(0x10)(Edit, BlueprintVisible)
	TArray<struct FDataTableRowHandle>           RandomStartingShoes;                               // 0x670(0x10)(Edit, BlueprintVisible)
	TArray<struct FDataTableRowHandle>           RandomStartingHelmet;                              // 0x680(0x10)(Edit, BlueprintVisible)
	TArray<struct FS_StartingWeaponItem>         RandomStartingPrimaryWeapon;                       // 0x690(0x10)(Edit, BlueprintVisible)
	TArray<struct FS_StartingWeaponItem>         RandomStartingSecondaryWeapon;                     // 0x6A0(0x10)(Edit, BlueprintVisible)

	static class UClass* StaticClass();
	static class UBP_EquipmentInventory_C* GetDefaultObj();

	void SGK_AllowStartingItems(bool* AllowStartingItems);
	void EquipmentInventoryReplication(bool Replicate, int32 CallFunc_MakeLiteralInt_ReturnValue, int32 Temp_int_Variable, int32 Temp_int_Variable_1, uint8 CallFunc_Conv_IntToByte_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, uint8 CallFunc_GetValidValue_ReturnValue, uint8 CallFunc_Conv_IntToByte_ReturnValue_1, bool CallFunc_CheckEquipmentSlot_SlotFull, uint8 CallFunc_GetEnumeratorValueFromIndex_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue, const struct FS_EquipmentSlot& CallFunc_SelectEquipmentSlot_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void RandomStartingEquipment();
