#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x120 (0x450 - 0x330)
// BlueprintGeneratedClass BP_SGKGameMode.BP_SGKGameMode_C
class ABP_SGKGameMode_C : public AGameModeBase
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x330(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_GameModeInitComponent_C*           BP_GameModeInitComponent;                          // 0x338(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x340(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_SGKSaveGame_C*                     UMISaveGame;                                       // 0x348(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_SaveSystem_C*                      SaveSystem;                                        // 0x350(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_MasterGrid_C*                      FoundationGrid;                                    // 0x358(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_ResourceManager_C*                 ResourceManager;                                   // 0x360(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_MasterGrid_C*                      WallGrid;                                          // 0x368(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_GlobalInventoryManager_C*          GlobalInventoryManager;                            // 0x370(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            CreateInventory;                                   // 0x378(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         PlayerList;                                        // 0x388(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E4C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class APlayerController*>             PlayerListGamemode;                                // 0x390(0x10)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance, RepNotify)
	class ABP_AK74_RA_C*                         Enemy;                                             // 0x3A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        SpawnAmount;                                       // 0x3A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E4D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          EnemyTImerHandle;                                  // 0x3B0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        Wave;                                              // 0x3B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E4E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class APlayerStart*>                  SealsStart;                                        // 0x3C0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class APlayerStart*>                  InsurgentsStart;                                   // 0x3D0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class APlayerController*>             PlayerControllers;                                 // 0x3E0(0x10)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	class UObject*                               Beacon;                                            // 0x3F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            EndMatch;                                          // 0x3F8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         ActorLoadingQueue;                                 // 0x408(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E4F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class APlayerController*>             PlayerControllerQueue;                             // 0x410(0x10)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class APlayerController*>             All_Players_PCs;                                   // 0x420(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class APlayerController*>             SealControllers;                                   // 0x430(0x10)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class APlayerController*>             InsurgentControllers;                              // 0x440(0x10)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class ABP_SGKGameMode_C* GetDefaultObj();

	void SGK_GetInitComponent(class UBP_GameModeInitComponent_C** InitComponent);
	void SGK_GetResourceManager(class ABP_ResourceManager_C** ResourceManager);
	void SGK_GetSaveGame(class ABP_SaveSystem_C** SaveGame);
	void SGK_GetGlobalInventory(class ABP_GlobalInventoryManager_C** GlobalInventory);
	void CheckFFA(bool* FFA_, const class FString& CallFunc_GetCurrentLevelName_ReturnValue, bool CallFunc_Contains_ReturnValue);
	void CalculePlayerToolsItems(class ABP_SGKMasterCharacter_C* Target, class APeak53PlayerState_C* PlayerState, TArray<struct FS_CraftingCost>* TempArray1, const TArray<class FString>& AmmoBuckshotList, const TArray<class FString>& Ammo9MMList, const TArray<class FString>& Ammo7_62List, int32 Amount, const TArray<struct FS_CraftingCost>& TempArray, TArray<class FString>& K2Node_MakeArray_Array, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, TArray<class FString>& K2Node_MakeArray_Array_1, TArray<class FString>& K2Node_MakeArray_Array_2, int32 Temp_int_Array_Index_Variable, const struct FS_CraftingCost& CallFunc_Array_Get_Item, int32 Temp_int_Loop_Counter_Variable, bool K2Node_SwitchName_CmpSuccess, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 Temp_int_Array_Index_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, const struct FS_StartingWeaponItem& CallFunc_Array_Get_Item_1, int32 CallFunc_Add_IntInt_ReturnValue_1, const class FString& CallFunc_Conv_NameToString_ReturnValue, const class FString& CallFunc_Conv_NameToString_ReturnValue_1, const struct FDataTableRowHandle& K2Node_MakeStruct_DataTableRowHandle, const struct FS_CraftingCost& K2Node_MakeStruct_S_CraftingCost, const struct FDataTableRowHandle& K2Node_MakeStruct_DataTableRowHandle_1, int32 CallFunc_Array_Add_ReturnValue, const struct FS_CraftingCost& K2Node_MakeStruct_S_CraftingCost_1, int32 CallFunc_Array_Add_ReturnValue_1, const struct FDataTableRowHandle& K2Node_MakeStruct_DataTableRowHandle_2, const struct FS_CraftingCost& K2Node_MakeStruct_S_CraftingCost_2, int32 CallFunc_Array_Add_ReturnValue_2, const struct FDataTableRowHandle& K2Node_MakeStruct_DataTableRowHandle_3, bool CallFunc_Array_Contains_ReturnValue, const struct FS_CraftingCost& K2Node_MakeStruct_S_CraftingCost_3, const struct FDataTableRowHandle& K2Node_MakeStruct_DataTableRowHandle_4, int32 CallFunc_Array_Add_ReturnValue_3, const struct FS_CraftingCost& K2Node_MakeStruct_S_CraftingCost_4, int32 CallFunc_Array_Add_ReturnValue_4, bool CallFunc_Array_Contains_ReturnValue_1, const struct FDataTableRowHandle& K2Node_MakeStruct_DataTableRowHandle_5, const struct FS_CraftingCost& K2Node_MakeStruct_S_CraftingCost_5, int32 CallFunc_Array_Add_ReturnValue_5, bool CallFunc_Array_Contains_ReturnValue_2, const struct FS_CraftingCost& K2Node_MakeStruct_S_CraftingCost_6, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Array_Add_ReturnValue_6, bool CallFunc_Less_IntInt_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable_2, const struct FS_StartingWeaponItem& CallFunc_Array_Get_Item_2, const class FString& CallFunc_Conv_NameToString_ReturnValue_2, const class FString& CallFunc_Conv_NameToString_ReturnValue_3, bool CallFunc_Array_Contains_ReturnValue_3, bool CallFunc_Array_Contains_ReturnValue_4, bool CallFunc_Array_Contains_ReturnValue_5);
	void OnRep_PlayerListGameMode(class AGameStateBase* CallFunc_GetGameState_ReturnValue, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State, bool K2Node_DynamicCast_bSuccess);
	class APawn* SpawnDefaultPawnAtTransform(class AController* NewPlayer, struct FTransform& SpawnTransform, const struct FTransform& NewSpawnTransformL, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_IsValid_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_FindPlayerLocation_ReturnValue, const struct FTransform& CallFunc_FindPlayerLocation_Transform, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class APawn* CallFunc_FinishSpawningActor_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, class ABP_SaveSystem_C* CallFunc_FinishSpawningActor_ReturnValue_1, TArray<class ABP_SaveSystem_C*>& CallFunc_GetAllActorsOfClass_OutActors, class ABP_SaveSystem_C* CallFunc_Array_Get_Item, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2, class APawn* CallFunc_FinishSpawningActor_ReturnValue_2, bool CallFunc_Array_IsValidIndex_ReturnValue);
	void SGK_SaveGame();
	void HandleStartingNewPlayer(class APlayerController* NewPlayer);
	void CMDAddPlayerControllerQueue(class APlayerController*& NewItem);
	void K2_OnSwapPlayerControllers(class APlayerController* OldPC, class APlayerController* NewPC);
	void ReceiveTick(float DeltaSeconds);
	void K2_OnLogout(class AController* ExitingController);
	void K2_PostLogin(class APlayerController* NewPlayer);
	void AddPlayersStarts();
	void RestartPlayerEvent(class APlayerController* PlayerController);
	void ReceiveBeginPlay();
	void SGK_SetSaveSystem(class ABP_SaveSystem_C* SaveSystem);
	void SpectateTeam(enum class EPeak53Teams PlayerTeam, class ABP_SGKController_C* Controller);
	void SpawnSpectatorBP(class AActor* Parent_Actor, class AActor* Owner);
	void LoopThroughTeammates(enum class EPeak53Teams PlayerTeam, class ABP_SGKController_C* Controller);
	void ExecuteUbergraph_BP_SGKGameMode(int32 EntryPoint, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_HasAuthority_ReturnValue, int32 Temp_int_Array_Index_Variable_1, class APlayerController* K2Node_Event_NewPlayer_1, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, class APlayerController* K2Node_CustomEvent_NewItem, bool CallFunc_IsDedicatedServer_ReturnValue, int32 CallFunc_Array_AddUnique_ReturnValue, int32 Temp_int_Loop_Counter_Variable_2, class APlayerController* Temp_object_Variable, int32 CallFunc_Add_IntInt_ReturnValue_2, class APlayerController* K2Node_Event_OldPC, class APlayerController* K2Node_Event_NewPC, int32 CallFunc_Array_Add_ReturnValue_1, class APawn* CallFunc_K2_GetPawn_ReturnValue, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_CheckFFA_FFA_, bool CallFunc_HasAuthority_ReturnValue_1, int32 Temp_int_Array_Index_Variable_2, bool CallFunc_IsServer_ReturnValue, float K2Node_Event_DeltaSeconds, class APlayerController* CallFunc_Array_Get_Item, class APlayerController* CallFunc_Array_Get_Item_1, bool CallFunc_Array_RemoveItem_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_2, const class FString& CallFunc_Conv_IntToString_ReturnValue, bool CallFunc_Array_IsEmpty_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, int32 Temp_int_Array_Index_Variable_3, class AController* K2Node_Event_ExitingController, class APlayerController* K2Node_DynamicCast_AsPlayer_Controller, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_Array_RemoveItem_ReturnValue_1, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State, bool K2Node_DynamicCast_bSuccess_2, class APlayerController* K2Node_Event_NewPlayer, class APawn* CallFunc_K2_GetPawn_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_4, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController_1, bool K2Node_DynamicCast_bSuccess_3, int32 CallFunc_Array_AddUnique_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_5, bool CallFunc_HasAuthority_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_1, TArray<class APlayerStart*>& CallFunc_GetAllActorsOfClass_OutActors, class APlayerStart* CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_4, int32 CallFunc_Array_AddUnique_ReturnValue_2, int32 CallFunc_Array_AddUnique_ReturnValue_3, bool CallFunc_EqualEqual_NameName_ReturnValue, class APlayerController* K2Node_CustomEvent_PlayerController, int32 CallFunc_Array_Add_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_6, class APeak53PlayerState_C* K2Node_DynamicCast_AsPeak_53Player_State, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_IsValid_ReturnValue_7, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, class APeak53PlayerState_C* K2Node_DynamicCast_AsPeak_53Player_State_1, bool K2Node_DynamicCast_bSuccess_5, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController_2, bool K2Node_DynamicCast_bSuccess_6, bool CallFunc_NotEqual_ClassClass_ReturnValue, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController_3, bool K2Node_DynamicCast_bSuccess_7, int32 CallFunc_Array_Find_ReturnValue, int32 CallFunc_Clamp_ReturnValue, bool CallFunc_Array_RemoveItem_ReturnValue_2, const class FString& CallFunc_Conv_IntToString_ReturnValue_1, int32 CallFunc_Array_Find_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, bool CallFunc_Array_IsValidIndex_ReturnValue, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController_4, bool K2Node_DynamicCast_bSuccess_8, class APeak53PlayerState_C* K2Node_DynamicCast_AsPeak_53Player_State_2, bool K2Node_DynamicCast_bSuccess_9, int32 CallFunc_Array_Find_ReturnValue_2, int32 CallFunc_Clamp_ReturnValue_1, const class FString& CallFunc_Conv_IntToString_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_SelectString_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_5, class AActor* CallFunc_K2_FindPlayerStart_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController_5, bool K2Node_DynamicCast_bSuccess_10, const struct FTransform& CallFunc_MakeTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class AActor* CallFunc_FinishSpawningActor_ReturnValue, class APawn* CallFunc_K2_GetPawn_ReturnValue_2, class ABP_SGKMasterCharacter_C* K2Node_DynamicCast_AsBP_SGKMaster_Character, bool K2Node_DynamicCast_bSuccess_11, bool CallFunc_IsValid_ReturnValue_8, TArray<struct FS_CraftingCost>& CallFunc_CalculePlayerToolsItems_TempArray1, const struct FS_ContainerDetails& K2Node_MakeStruct_S_ContainerDetails, class ABP_SaveSystem_C* K2Node_Event_SaveSystem, enum class EPeak53Teams K2Node_CustomEvent_PlayerTeam_1, class ABP_SGKController_C* K2Node_CustomEvent_Controller_1, int32 CallFunc_Add_IntInt_ReturnValue_3, class AActor* K2Node_CustomEvent_Parent_Actor, class AActor* K2Node_CustomEvent_Owner, class APlayerController* CallFunc_Array_Get_Item_3, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController_6, bool K2Node_DynamicCast_bSuccess_12, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController_7, bool K2Node_DynamicCast_bSuccess_13, class APeak53PlayerState_C* K2Node_DynamicCast_AsPeak_53Player_State_3, bool K2Node_DynamicCast_bSuccess_14, bool CallFunc_Greater_IntInt_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, int32 CallFunc_Array_Length_ReturnValue_6, const struct FTransform& CallFunc_MakeTransform_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_2, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1, class ASpectatorCharacter_C* CallFunc_FinishSpawningActor_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue_3, int32 CallFunc_Array_Add_ReturnValue_4, enum class EPeak53Teams K2Node_CustomEvent_PlayerTeam, class ABP_SGKController_C* K2Node_CustomEvent_Controller, bool K2Node_SwitchEnum_CmpSuccess_1, class APlayerController* CallFunc_Array_Get_Item_4, class APlayerController* CallFunc_Array_Get_Item_5, class APawn* CallFunc_K2_GetPawn_ReturnValue_3, class APawn* CallFunc_K2_GetPawn_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_9, bool CallFunc_IsValid_ReturnValue_10, const struct FTransform& CallFunc_MakeTransform_ReturnValue_2, bool CallFunc_HasAuthority_ReturnValue_3, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2, class ABP_ResourceManager_C* CallFunc_FinishSpawningActor_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable_3, bool CallFunc_Less_IntInt_ReturnValue_3, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 Temp_int_Array_Index_Variable_4, class APlayerController* CallFunc_Array_Get_Item_6, class APeak53PlayerState_C* K2Node_DynamicCast_AsPeak_53Player_State_4, bool K2Node_DynamicCast_bSuccess_15, class AGameStateBase* CallFunc_GetGameState_ReturnValue_1, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_1, bool K2Node_DynamicCast_bSuccess_16, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1, class FName CallFunc_Conv_StringToName_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue_1, const struct FTransform& CallFunc_MakeTransform_ReturnValue_3, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3, bool CallFunc_IsDedicatedServer_ReturnValue_1, class ABP_GlobalInventoryManager_C* CallFunc_FinishSpawningActor_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_11, int32 CallFunc_Array_AddUnique_ReturnValue_4, int32 Temp_int_Variable);
	void EndMatch__DelegateSignature();
	void CreateInventory__DelegateSignature();
};

}


