#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x1 (0x1 - 0x0)
// Function BP_SinglePlayerMenu.BP_SinglePlayerMenu_C.BndEvt__BP_SinglePlayerMenu_BP_WidgetToggleButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
struct UBP_SinglePlayerMenu_C_BndEvt__BP_SinglePlayerMenu_BP_WidgetToggleButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature_Params
{
public:
	enum class E_WidgetToggleType                WidgetToggleType;                                  // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function BP_SinglePlayerMenu.BP_SinglePlayerMenu_C.BndEvt__BP_SinglePlayerMenu_BP_WidgetToggleButton_149_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
struct UBP_SinglePlayerMenu_C_BndEvt__BP_SinglePlayerMenu_BP_WidgetToggleButton_149_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature_Params
{
public:
	enum class E_WidgetToggleType                WidgetToggleType;                                  // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function BP_SinglePlayerMenu.BP_SinglePlayerMenu_C.BindOnClicked
struct UBP_SinglePlayerMenu_C_BindOnClicked_Params
{
public:
	enum class E_WidgetToggleType                WidgetToggleType;                                  // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function BP_SinglePlayerMenu.BP_SinglePlayerMenu_C.PreConstruct
struct UBP_SinglePlayerMenu_C_PreConstruct_Params
{
public:
	bool                                         IsDesignTime;                                      // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1B (0x1B - 0x0)
// Function BP_SinglePlayerMenu.BP_SinglePlayerMenu_C.ExecuteUbergraph_BP_SinglePlayerMenu
struct UBP_SinglePlayerMenu_C_ExecuteUbergraph_BP_SinglePlayerMenu_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_WidgetToggleType                K2Node_ComponentBoundEvent_WidgetToggleType;       // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3E08[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0x8(0x10)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	enum class E_WidgetToggleType                K2Node_ComponentBoundEvent_WidgetToggleType_1;     // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_WidgetToggleType                K2Node_CustomEvent_WidgetToggleType;               // 0x19(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_Event_IsDesignTime;                         // 0x1A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


