#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x218 (0x3D8 - 0x1C0)
// BlueprintGeneratedClass BP_SGKGameInstance.BP_SGKGameInstance_C
class UBP_SGKGameInstance_C : public UGameInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x1C0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                SaveGameSlotName;                                  // 0x1C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                         MenuOpenedLevel;                                   // 0x1D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4ED7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBP_SGKSettingsSaveData_C*             OptionsSave;                                       // 0x1E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         LoadSaveGame;                                      // 0x1E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4ED8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            GameSettingsUpdated;                               // 0x1F0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                       MouseSense;                                        // 0x200(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EPeak53Teams                      TeamSelection;                                     // 0x208(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4ED9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               SelectedLoadout;                                   // 0x210(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                  PlayerName;                                        // 0x218(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify)
	class UClass*                                Loadout;                                           // 0x230(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash)
	enum class EPeak53Teams                      PlayerTeam;                                        // 0x238(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EDA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Lobby_Name;                                        // 0x240(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                Map;                                               // 0x250(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                        Max_Players;                                       // 0x260(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsHost;                                            // 0x264(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsInLobby;                                         // 0x265(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EDB[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ReadyState;                                        // 0x268(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FTimerHandle                          TimerServerHearthbeat;                             // 0x278(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         AllowJoinInProgress;                               // 0x280(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EDC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSteamID                              CurrentSteamID;                                    // 0x288(0x8)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                        WeaponSealsPrimary;                                // 0x290(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                        WeaponSealsSecondary;                              // 0x2A0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                        WeaponInurgentsPrimary;                            // 0x2B0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                        WeaponInurgentsSecondary;                          // 0x2C0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                        WeaponTools;                                       // 0x2D0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_StartingWeaponItem>         WeaponPrimary;                                     // 0x2E0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_StartingWeaponItem>         WeaponSecondary;                                   // 0x2F0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_CraftingCost>               WeaponTool1;                                       // 0x300(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_CraftingCost>               WeaponTool2;                                       // 0x310(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                  CurrentLevelName;                                  // 0x320(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Aimed_Sense;                                       // 0x328(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SteamGlobalRank;                                   // 0x330(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsJoiningSession;                                  // 0x334(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsDedicatedServer;                                 // 0x335(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EDD[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ServerName;                                        // 0x338(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                ServerMap;                                         // 0x348(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                         bRefreshingSteamInventory;                         // 0x358(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EDE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnSteamInventoryFullUpdateFinished;                // 0x360(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         bRefreshingItemPrices;                             // 0x370(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EDF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FSteamItemDetails>             CurrentSteamUserInventory;                         // 0x378(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                SteamBuyItems;                                     // 0x388(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	enum class EPeak53Teams                      CurrentCustomizationTeam;                          // 0x398(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EE0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        All_Lodouts;                                       // 0x3A0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_            OnGetAllLodoutsFinished;                           // 0x3B0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnLoadLodoutFinished;                              // 0x3C0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USg_lodout_C*                          CurrentLoadedLoadout;                              // 0x3D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UBP_SGKGameInstance_C* GetDefaultObj();

	void SGK_AimedSense(double* AimedSense);
	void SGK_MouseSense(double* MouseSense);
	void SGK_Options_Save(class UBP_SGKSettingsSaveData_C** Settings, bool CallFunc_IsValid_ReturnValue);
	void SGK_GetMenuOpenedLevel(bool* MenuOpenedLevel);
	void SGK_GetSaveGameSlotName(class FString* SaveGameSlotName);
	void SGK_GetLoadSaveGame(bool* LoadSaveGame);
