#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x141 (0x229 - 0xE8)
// BlueprintGeneratedClass DebugComponent.DebugComponent_C
class UDebugComponent_C : public UALSDebugComponent
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xE8(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                          AdditiveAmount_Color;                              // 0xF0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          OverlayLayerColor;                                 // 0x100(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          BaseLayerColor;                                    // 0x110(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          HandIK_Color;                                      // 0x120(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Hand_Color;                                        // 0x130(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Pelvis;                                            // 0x140(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Shoulder_L;                                        // 0x148(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Upperarm_l;                                        // 0x150(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Lowerarm_l;                                        // 0x158(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Lowerarm_r;                                        // 0x160(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Shoulder_R;                                        // 0x168(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Upperarm_r;                                        // 0x170(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Hand_R;                                            // 0x178(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Hand_L;                                            // 0x180(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              LowerLegs;                                         // 0x188(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              UpperLegs;                                         // 0x190(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Feet;                                              // 0x198(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Head;                                              // 0x1A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              Torso;                                             // 0x1A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         SolidColor;                                        // 0x1B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3A10[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          SkinColor;                                         // 0x1B4(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          DefaultColor;                                      // 0x1C4(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        PantsType;                                         // 0x1D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Shoes;                                             // 0x1D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Gloves;                                            // 0x1D9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3A11[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          GlovesColor;                                       // 0x1DC(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          ShoesColor;                                        // 0x1EC(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          PantsColor;                                        // 0x1FC(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          ShirtColor;                                        // 0x20C(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ShirtType;                                         // 0x21C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlayStateSwitcher_C*               OverlaySwitcher;                                   // 0x220(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                         OverlayMenuOpen;                                   // 0x228(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UDebugComponent_C* GetDefaultObj();

	void IsMaterialValid(bool* Valid_, bool CallFunc_IsValid_ReturnValue);
	void IsMeshValid(class USkeletalMesh* SkeletalMesh, bool* Valid_, bool CallFunc_EqualEqual_ObjectObject_ReturnValue);
	void OnSetDynamicMaterials(bool CallFunc_IsValid_ReturnValue, class USkeletalMesh* CallFunc_GetSkeletalMesh_DEPRECATED_ReturnValue, bool CallFunc_IsMeshValid_Valid_, int32 CallFunc_GetMaterialIndex_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, int32 CallFunc_GetMaterialIndex_ReturnValue_1, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_1, int32 CallFunc_GetMaterialIndex_ReturnValue_2, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_2, int32 CallFunc_GetMaterialIndex_ReturnValue_3, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_3, int32 CallFunc_GetMaterialIndex_ReturnValue_4, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_4, int32 CallFunc_GetMaterialIndex_ReturnValue_5, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_5, int32 CallFunc_GetMaterialIndex_ReturnValue_6, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_6, int32 CallFunc_GetMaterialIndex_ReturnValue_7, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_7, int32 CallFunc_GetMaterialIndex_ReturnValue_8, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_8, int32 CallFunc_GetMaterialIndex_ReturnValue_9, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_9, int32 CallFunc_GetMaterialIndex_ReturnValue_10, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_10, int32 CallFunc_GetMaterialIndex_ReturnValue_11, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_11, int32 CallFunc_GetMaterialIndex_ReturnValue_12, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_12, int32 CallFunc_GetMaterialIndex_ReturnValue_13, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_13);
	void OnSetResetColors(bool CallFunc_IsMaterialValid_Valid_, bool K2Node_SwitchInteger_CmpSuccess, bool K2Node_SwitchInteger_CmpSuccess_1);
	void OnUpdateColoringSystem(float CallFunc_GetAnimCurveValue_ReturnValue, float CallFunc_GetAnimCurveValue_ReturnValue_1, float CallFunc_GetAnimCurveValue_ReturnValue_2, float CallFunc_GetAnimCurveValue_ReturnValue_3, float CallFunc_GetAnimCurveValue_ReturnValue_4, float CallFunc_GetAnimCurveValue_ReturnValue_5, float CallFunc_GetAnimCurveValue_ReturnValue_6, float CallFunc_GetAnimCurveValue_ReturnValue_7, float CallFunc_GetAnimCurveValue_ReturnValue_8, float CallFunc_GetAnimCurveValue_ReturnValue_9, float CallFunc_GetAnimCurveValue_ReturnValue_10, const struct FLinearColor& CallFunc_K2_GetVectorParameterValue_ReturnValue, const struct FLinearColor& CallFunc_K2_GetVectorParameterValue_ReturnValue_1, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue_1, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue_2, float CallFunc_GetAnimCurveValue_ReturnValue_11, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue_3, float CallFunc_GetAnimCurveValue_ReturnValue_12, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue_4, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue_5, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue_6, float CallFunc_GetAnimCurveValue_ReturnValue_13, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue_7, bool CallFunc_IsMaterialValid_Valid_, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue_8, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue_9, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue_10, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue_11, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue_12, const struct FLinearColor& CallFunc_LinearColorLerp_ReturnValue_13);
	void OnDrawDebugSpheres(const struct FRotator& CallFunc_GetControlRotation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_Conv_RotatorToVector_ReturnValue, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, const struct FVector& CallFunc_Vector_NormalUnsafe_ReturnValue, float CallFunc_GetScaledCapsuleHalfHeight_ReturnValue, float CallFunc_GetScaledCapsuleRadius_ReturnValue, const struct FVector& CallFunc_GetSocketLocation_ReturnValue, const struct FVector& CallFunc_Conv_RotatorToVector_ReturnValue_1, float CallFunc_GetMaxAcceleration_ReturnValue, const struct FVector& CallFunc_Vector_NormalUnsafe_ReturnValue_1, const struct FVector& CallFunc_GetCurrentAcceleration_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, double CallFunc_VSize_ReturnValue, bool CallFunc_EqualEqual_VectorVector_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue, const struct FLinearColor& CallFunc_SelectColor_ReturnValue, double CallFunc_MapRangeClamped_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_Conv_RotatorToVector_ReturnValue_2, const struct FVector& CallFunc_SelectVector_ReturnValue, float CallFunc_GetScaledCapsuleHalfHeight_ReturnValue_1, const struct FVector& CallFunc_Vector_NormalUnsafe_ReturnValue_2, double CallFunc_Subtract_DoubleDouble_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, float CallFunc_GetScaledCapsuleHalfHeight_ReturnValue_2, double CallFunc_Subtract_DoubleDouble_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Conv_RotatorToVector_ReturnValue_3, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FVector& CallFunc_GetVelocity_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_3, double CallFunc_VSize_ReturnValue_1, bool CallFunc_EqualEqual_VectorVector_ReturnValue_1, double CallFunc_MapRangeClamped_ReturnValue_1, const struct FLinearColor& CallFunc_SelectColor_ReturnValue_1, const struct FVector& CallFunc_SelectVector_ReturnValue_1, const struct FVector& CallFunc_Vector_NormalUnsafe_ReturnValue_3, float CallFunc_GetScaledCapsuleHalfHeight_ReturnValue_3, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue_2, const struct FVector& CallFunc_MakeVector_ReturnValue_2, bool CallFunc_IsDedicatedServer_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_2, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_2, double CallFunc_Divide_DoubleDouble_B_ImplicitCast, double CallFunc_Subtract_DoubleDouble_A_ImplicitCast, double CallFunc_Subtract_DoubleDouble_A_ImplicitCast_1, double CallFunc_MapRangeClamped_InRangeB_ImplicitCast, double CallFunc_MakeVector_Z_ImplicitCast);
	void DrawDebugSpheres();
	void UpdateColoringSystem();
	void SetDynamicMaterials();
	void SetResetColors();
	void OpenOverlayMenu(bool bValue);
	void OverlayMenuCycle(bool bValue);
	void OnPlayerControllerInitialized(class APlayerController* Controller);
	void ExecuteUbergraph_DebugComponent(int32 EntryPoint, class APlayerController* K2Node_Event_Controller, class UALS_HUD_C* CallFunc_Create_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsLocalController_ReturnValue, bool K2Node_Event_bValue_1, bool K2Node_Event_bValue, class AController* CallFunc_GetController_ReturnValue, class AALS_Player_Controller_C* K2Node_DynamicCast_AsALS_Player_Controller, bool K2Node_DynamicCast_bSuccess, class UOverlayStateSwitcher_C* CallFunc_Create_ReturnValue_1);
};

}


