#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x80 (0x80 - 0x0)
// UserDefinedStruct Footsteps_Sound_Struct.Footsteps_Sound_Struct
struct FFootsteps_Sound_Struct
{
public:
	class USoundBase*                            Default_3_4DEA20B0446FEC47A6040BAAD355AC2E;        // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Rock_5_EFF7C8BB4C4C44D41ABA73807144D250;           // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Sand_7_BDC472EC4038AA37E5ECAF8245C73DC1;           // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Concrete_9_0259541A4BC273DE18747BBB255DEFCA;       // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Stone_11_180BD80D464DE3F83F756A8BE935A2E8;         // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Wood_16_DCDF1D884E29B525A852948E572247B7;          // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Glass_17_437BA37F47E11276AF804EAADEFDB56C;         // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Grass_19_CEFA995B42F9C7E6B722FD900AC5C426;         // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Dirt_23_691FC6394AD69D151B613BBEFE7C3452;          // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Snow_25_01B5E27747EF8D6ECBAF25B13315905B;          // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Metal_28_378D9DE24015EBE6C65F9196F8CAD29F;         // 0x50(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Puddle_31_4C11A3EA4DD8D0A74969EC9882E8EC2C;        // 0x58(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Flesh_34_08E15BC448438D048D517AA5242D9631;         // 0x60(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            PuddleSmall_37_0A54A54248C5982A20F0B48E99275DEF;   // 0x68(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Carpet_40_D13721F0455A684B1948BCA2BE7A5941;        // 0x70(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                            Leaves_43_79959E1A43E542B266BB478D27CC6040;        // 0x78(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}


