#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xE3 (0x373 - 0x290)
// BlueprintGeneratedClass GameManager.GameManager_C
class AGameManager_C : public AActor
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x290(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                  Cube;                                              // 0x298(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x2A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                       CurrentRoundTimer;                                 // 0x2A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MaxRoundTimer;                                     // 0x2B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                       GameTimer;                                         // 0x2B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_SGKController_C*>           Seals;                                             // 0x2C0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_SGKController_C*>           Insurgents;                                        // 0x2D0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                          RoundTimer;                                        // 0x2E0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       RoundCountdown;                                    // 0x2E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EPeak53Teams                      WinnerTeam;                                        // 0x2F0(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bDemolition_;                                      // 0x2F1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_4BFC[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APlantedBomb_C*                        BombRef;                                           // 0x2F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                       BombLocations;                                     // 0x300(0x10)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	int32                                        DisconnectTimer;                                   // 0x310(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4BFD[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  MVPRoundEndName;                                   // 0x318(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	int32                                        MVPRoundEndScore;                                  // 0x330(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MVPRoundEndKills;                                  // 0x334(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MVPRoundEndDeaths;                                 // 0x338(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SealsScore;                                        // 0x33C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SealsKills;                                        // 0x340(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SealsDeaths;                                       // 0x344(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        InsurgentsScore;                                   // 0x348(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        InsurgentsKills;                                   // 0x34C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        InsurgentsDeaths;                                  // 0x350(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bFFA;                                              // 0x354(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_4BFE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABP_SGKController_C*>           FFA;                                               // 0x358(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                         PauseRoundEndChecks;                               // 0x368(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4BFF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TempItemUnlockID;                                  // 0x36C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Is_Bomb_Planted;                                   // 0x370(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         BombDefusedCheck;                                  // 0x371(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bBombExploded;                                     // 0x372(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class AGameManager_C* GetDefaultObj();

	void GetBombPlantedState(bool* BombState);
	void SetBombPlantedState(bool IsBombPlanted);
	void CheckFFA(bool* FFA_, const class FString& CallFunc_GetCurrentLevelName_ReturnValue, bool CallFunc_Contains_ReturnValue);
	void GetTeamStats(enum class EPeak53Teams B, int32* CurrentHightScore1, int32* Currentkills1, int32* Currentdeaths1, int32 Currentdeaths, int32 Currentkills, class FText MVPName, int32 CurrentHightScore, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue, class APlayerState* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class APeak53PlayerState_C* K2Node_DynamicCast_AsPeak_53Player_State, bool K2Node_DynamicCast_bSuccess_1, const class FString& CallFunc_Conv_TextToString_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue_1, int32 CallFunc_Conv_StringToInt_ReturnValue, int32 CallFunc_Conv_StringToInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, const class FString& CallFunc_Conv_TextToString_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue, int32 CallFunc_Conv_StringToInt_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_3);
	void GetGameEndMVP(class FText* MVPName1, int32* CurrentHightScore1, int32* Currentkills1, int32* Currentdeaths1, int32 MVPIndex, int32 Currentdeaths, int32 Currentkills, class FText MVPName, int32 CurrentHightScore, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int64 CallFunc_Conv_IntToInt64_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue, class APlayerState* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class APeak53PlayerState_C* K2Node_DynamicCast_AsPeak_53Player_State, bool K2Node_DynamicCast_bSuccess_1, const class FString& CallFunc_Conv_TextToString_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue_1, int32 CallFunc_Conv_StringToInt_ReturnValue, int32 CallFunc_Conv_StringToInt_ReturnValue_1, const class FString& CallFunc_Conv_TextToString_ReturnValue_2, class APlayerState* CallFunc_Array_Get_Item_1, int64 CallFunc_ParseStringIntoLong_ReturnValue, class APeak53PlayerState_C* K2Node_DynamicCast_AsPeak_53Player_State_1, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_Greater_Int64Int64_ReturnValue, int32 CallFunc_Conv_Int64ToInt_ReturnValue);
	void SendFeedMessage(class FText MessageFeedVar, enum class ETextJustify Justification, const struct FSlateColor& In_Color_and_Opacity, int32 In_Font_Info_Size);
	void SendFeedMessageMC(class FText MessageFeedVar, enum class ETextJustify Justification, const struct FSlateColor& In_Color_and_Opacity, int32 In_Font_Info_Size);
	void CheckRoundFinishServer();
	void BeginRoundServer();
	void SetRoundTimerClients(double CurrentRoundTimer);
	void CheckRoundFinishMulticast();
	void ResetDoOnce();
	void LateJoiners();
	void GameEnd();
	void BombDefusedManagerServer(bool SealsTrue, bool bExploded_);
	void BombDefusedManagerMulticast(bool SealsTrue, bool bExploded_);
	void ReceiveBeginPlay();
	void ResetBombsSV(TArray<struct FVector>& Array);
	void ResetBombsMC(TArray<struct FVector>& Array);
	void SetRoundEndCheckServer(bool PauseRoundEndChecks);
	void SetRoundEndChecksMC(bool PauseRoundEndChecks);
	void ExecuteUbergraph_GameManager(int32 EntryPoint, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, bool Temp_bool_Has_Been_Initd_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, bool Temp_bool_IsClosed_Variable, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable_2, int32 Temp_int_Array_Index_Variable_3, int32 Temp_int_Loop_Counter_Variable_3, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Array_Index_Variable_4, bool Temp_bool_IsClosed_Variable_1, int32 Temp_int_Loop_Counter_Variable_4, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 Temp_int_Loop_Counter_Variable_5, int32 CallFunc_Add_IntInt_ReturnValue_5, bool Temp_bool_True_if_break_was_hit_Variable, int32 Temp_int_Array_Index_Variable_5, bool CallFunc_Not_PreBool_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable_1, bool Temp_bool_IsClosed_Variable_2, int32 Temp_int_Array_Index_Variable_6, bool Temp_bool_Has_Been_Initd_Variable_2, int32 Temp_int_Loop_Counter_Variable_6, int32 CallFunc_Add_IntInt_ReturnValue_6, int32 Temp_int_Array_Index_Variable_7, bool Temp_bool_IsClosed_Variable_3, int32 Temp_int_Loop_Counter_Variable_7, int32 CallFunc_Add_IntInt_ReturnValue_7, int32 Temp_int_Array_Index_Variable_8, int32 Temp_int_Array_Index_Variable_9, int32 Temp_int_Loop_Counter_Variable_8, int32 CallFunc_Add_IntInt_ReturnValue_8, int32 Temp_int_Array_Index_Variable_10, int32 Temp_int_Loop_Counter_Variable_9, int32 Temp_int_Loop_Counter_Variable_10, int32 CallFunc_Add_IntInt_ReturnValue_9, int32 CallFunc_Add_IntInt_ReturnValue_10, int32 Temp_int_Loop_Counter_Variable_11, bool Temp_bool_Has_Been_Initd_Variable_3, int32 CallFunc_Add_IntInt_ReturnValue_11, int32 Temp_int_Array_Index_Variable_11, int32 Temp_int_Loop_Counter_Variable_12, int32 Temp_int_Array_Index_Variable_12, int32 CallFunc_Add_IntInt_ReturnValue_12, int32 Temp_int_Loop_Counter_Variable_13, int32 Temp_int_Loop_Counter_Variable_14, int32 CallFunc_Add_IntInt_ReturnValue_13, int32 CallFunc_Add_IntInt_ReturnValue_14, int32 Temp_int_Array_Index_Variable_13, int32 Temp_int_Array_Index_Variable_14, int32 Temp_int_Loop_Counter_Variable_15, int32 CallFunc_Add_IntInt_ReturnValue_15, int32 Temp_int_Array_Index_Variable_15, int32 Temp_int_Loop_Counter_Variable_16, int32 Temp_int_Loop_Counter_Variable_17, int32 CallFunc_Add_IntInt_ReturnValue_16, int32 CallFunc_Add_IntInt_ReturnValue_17, int32 Temp_int_Array_Index_Variable_16, TArray<class ABP_SGKController_C*>& CallFunc_GetAllActorsOfClass_OutActors, int32 Temp_int_Array_Index_Variable_17, int32 CallFunc_Array_Length_ReturnValue, class FText K2Node_CustomEvent_MessageFeedVar_1, enum class ETextJustify K2Node_CustomEvent_Justification_1, const struct FSlateColor& K2Node_CustomEvent_In_Color_and_Opacity_1, int32 K2Node_CustomEvent_In_Font_Info_Size_1, class FText K2Node_CustomEvent_MessageFeedVar, enum class ETextJustify K2Node_CustomEvent_Justification, const struct FSlateColor& K2Node_CustomEvent_In_Color_and_Opacity, int32 K2Node_CustomEvent_In_Font_Info_Size, TArray<class ABP_SGKController_C*>& CallFunc_GetAllActorsOfClass_OutActors_1, class ABP_SGKController_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue, class APeak53PlayerState_C* K2Node_DynamicCast_AsPeak_53Player_State, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Add_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess, class ABP_SGKController_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Array_RemoveItem_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class ABP_SGKController_C* CallFunc_Array_Get_Item_2, bool CallFunc_Array_RemoveItem_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_1, class ABP_SGKController_C* CallFunc_Array_Get_Item_3, class ABP_SGKController_C* CallFunc_Array_Get_Item_4, bool CallFunc_Array_IsEmpty_ReturnValue, bool CallFunc_Array_IsEmpty_ReturnValue_1, double K2Node_CustomEvent_CurrentRoundTimer, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue_1, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State, bool K2Node_DynamicCast_bSuccess_1, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_1, bool K2Node_DynamicCast_bSuccess_2, class AGameStateBase* CallFunc_GetGameState_ReturnValue_2, int32 Temp_int_Array_Index_Variable_18, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_2, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_LessEqual_IntInt_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue_3, const struct FSlateColor& K2Node_MakeStruct_SlateColor, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_3, bool K2Node_DynamicCast_bSuccess_4, class FText CallFunc_Conv_StringToText_ReturnValue, const struct FSlateColor& K2Node_MakeStruct_SlateColor_1, int32 CallFunc_Add_IntInt_ReturnValue_18, int32 CallFunc_Add_IntInt_ReturnValue_19, class FText CallFunc_Conv_StringToText_ReturnValue_1, const class FString& CallFunc_Conv_IntToString_ReturnValue, const struct FSlateColor& K2Node_MakeStruct_SlateColor_2, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, class FText CallFunc_Conv_StringToText_ReturnValue_2, TArray<class ABP_Claymore_C*>& CallFunc_GetAllActorsOfClass_OutActors_2, TArray<class ABP_Landmine_C*>& CallFunc_GetAllActorsOfClass_OutActors_3, int32 CallFunc_Array_Length_ReturnValue_4, int32 CallFunc_Array_Length_ReturnValue_5, int32 Temp_int_Loop_Counter_Variable_18, class AGameStateBase* CallFunc_GetGameState_ReturnValue_4, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_4, bool K2Node_DynamicCast_bSuccess_5, bool CallFunc_Less_IntInt_ReturnValue_2, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_20, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, int32 Temp_int_Array_Index_Variable_19, TArray<class ABP_SGKController_C*>& CallFunc_GetAllActorsOfClass_OutActors_4, class ABP_SGKController_C* CallFunc_Array_Get_Item_5, int32 CallFunc_Array_Length_ReturnValue_6, int32 CallFunc_Array_Add_ReturnValue_2, class APeak53PlayerState_C* K2Node_DynamicCast_AsPeak_53Player_State_1, bool K2Node_DynamicCast_bSuccess_6, int32 CallFunc_Array_Add_ReturnValue_3, bool K2Node_SwitchEnum_CmpSuccess_1, class AGameStateBase* CallFunc_GetGameState_ReturnValue_5, class AGameStateBase* CallFunc_GetGameState_ReturnValue_6, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_5, bool K2Node_DynamicCast_bSuccess_7, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_6, bool K2Node_DynamicCast_bSuccess_8, class APlayerState* CallFunc_Array_Get_Item_6, int32 CallFunc_Array_Length_ReturnValue_7, class APawn* CallFunc_GetPawn_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_3, class AActor* CallFunc_GetOwner_ReturnValue, class APeak53PlayerState_C* K2Node_DynamicCast_AsPeak_53Player_State_2, bool K2Node_DynamicCast_bSuccess_9, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController, bool K2Node_DynamicCast_bSuccess_10, const class FString& CallFunc_Conv_TextToString_ReturnValue, int32 CallFunc_Conv_StringToInt_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue_1, const class FString& CallFunc_Conv_TextToString_ReturnValue_2, int32 CallFunc_Conv_StringToInt_ReturnValue_1, int32 CallFunc_Conv_StringToInt_ReturnValue_2, class AGameStateBase* CallFunc_GetGameState_ReturnValue_7, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_7, bool K2Node_DynamicCast_bSuccess_11, bool CallFunc_Greater_IntInt_ReturnValue, class ABP_SGKController_C* CallFunc_Array_Get_Item_7, int32 CallFunc_Array_Length_ReturnValue_8, bool CallFunc_Array_RemoveItem_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_4, int32 Temp_int_Loop_Counter_Variable_19, bool CallFunc_Less_IntInt_ReturnValue_5, int32 CallFunc_Add_IntInt_ReturnValue_21, class ABP_SGKController_C* CallFunc_Array_Get_Item_8, int32 CallFunc_Array_Length_ReturnValue_9, bool CallFunc_Array_RemoveItem_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_6, class ABP_SGKController_C* CallFunc_Array_Get_Item_9, class AGameStateBase* CallFunc_GetGameState_ReturnValue_8, class ABP_SGKController_C* CallFunc_Array_Get_Item_10, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_8, bool K2Node_DynamicCast_bSuccess_12, class AGameStateBase* CallFunc_GetGameState_ReturnValue_9, class AGameStateBase* CallFunc_GetGameState_ReturnValue_10, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_9, bool K2Node_DynamicCast_bSuccess_13, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_10, bool K2Node_DynamicCast_bSuccess_14, TArray<class ABP_Claymore_C*>& CallFunc_GetAllActorsOfClass_OutActors_5, TArray<class ABP_Landmine_C*>& CallFunc_GetAllActorsOfClass_OutActors_6, class ABP_Claymore_C* CallFunc_Array_Get_Item_11, class ABP_Landmine_C* CallFunc_Array_Get_Item_12, int32 CallFunc_Array_Length_ReturnValue_10, int32 CallFunc_Array_Length_ReturnValue_11, bool CallFunc_Less_IntInt_ReturnValue_7, bool CallFunc_Less_IntInt_ReturnValue_8, class AGameStateBase* CallFunc_GetGameState_ReturnValue_11, int32 Temp_int_Loop_Counter_Variable_20, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_11, bool K2Node_DynamicCast_bSuccess_15, bool CallFunc_EqualEqual_IntInt_ReturnValue_2, bool CallFunc_EqualEqual_IntInt_ReturnValue_3, int32 CallFunc_Add_IntInt_ReturnValue_22, bool CallFunc_BooleanOR_ReturnValue_1, bool Temp_bool_True_if_break_was_hit_Variable_1, int32 Temp_int_Array_Index_Variable_20, bool CallFunc_Not_PreBool_ReturnValue_1, bool K2Node_CustomEvent_SealsTrue_1, bool K2Node_CustomEvent_bExploded__1, bool K2Node_CustomEvent_SealsTrue, bool K2Node_CustomEvent_bExploded_, const class FString& CallFunc_SelectString_ReturnValue, const class FString& CallFunc_SelectString_ReturnValue_1, class FText CallFunc_Conv_StringToText_ReturnValue_3, class FText CallFunc_Conv_StringToText_ReturnValue_4, class AGameStateBase* CallFunc_GetGameState_ReturnValue_12, TArray<class ABP_SGKController_C*>& CallFunc_GetAllActorsOfClass_OutActors_7, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_12, bool K2Node_DynamicCast_bSuccess_16, int32 CallFunc_Array_Length_ReturnValue_12, bool CallFunc_Less_IntInt_ReturnValue_9, const struct FSlateColor& K2Node_MakeStruct_SlateColor_3, bool CallFunc_BooleanAND_ReturnValue, TArray<class ABombItem_C*>& CallFunc_GetAllActorsOfClass_OutActors_8, int32 Temp_int_Array_Index_Variable_21, class ABombItem_C* CallFunc_Array_Get_Item_13, class ABP_SGKController_C* CallFunc_Array_Get_Item_14, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_13, bool CallFunc_Less_IntInt_ReturnValue_10, int32 CallFunc_Array_Add_ReturnValue_4, TArray<struct FVector>& K2Node_CustomEvent_Array_1, TArray<struct FVector>& K2Node_CustomEvent_Array, const struct FVector& CallFunc_Array_Get_Item_15, int32 CallFunc_Array_Length_ReturnValue_14, const struct FTransform& CallFunc_MakeTransform_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_11, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABombItem_C* CallFunc_FinishSpawningActor_ReturnValue, int32 Temp_int_Array_Index_Variable_22, class ABP_Claymore_C* CallFunc_Array_Get_Item_16, TArray<class ABombItem_C*>& CallFunc_GetAllActorsOfClass_OutActors_9, class ABombItem_C* CallFunc_Array_Get_Item_17, int32 CallFunc_Array_Length_ReturnValue_15, bool CallFunc_Less_IntInt_ReturnValue_12, TArray<class APlantedBomb_C*>& CallFunc_GetAllActorsOfClass_OutActors_10, class APlantedBomb_C* CallFunc_Array_Get_Item_18, int32 CallFunc_Array_Length_ReturnValue_16, bool CallFunc_Less_IntInt_ReturnValue_13, TArray<class ABP_SGKController_C*>& CallFunc_GetAllActorsOfClass_OutActors_11, int32 CallFunc_Array_Length_ReturnValue_17, const struct FSlateColor& K2Node_MakeStruct_SlateColor_4, bool CallFunc_Less_IntInt_ReturnValue_14, bool CallFunc_BooleanAND_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_21, class AGameStateBase* CallFunc_GetGameState_ReturnValue_13, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_13, bool K2Node_DynamicCast_bSuccess_17, bool CallFunc_Less_IntInt_ReturnValue_15, class APlayerState* CallFunc_Array_Get_Item_19, int32 CallFunc_Array_Length_ReturnValue_18, class APeak53PlayerState_C* K2Node_DynamicCast_AsPeak_53Player_State_3, bool K2Node_DynamicCast_bSuccess_18, bool CallFunc_Less_IntInt_ReturnValue_16, class AActor* CallFunc_GetOwner_ReturnValue_1, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController_1, bool K2Node_DynamicCast_bSuccess_19, int32 CallFunc_Add_IntInt_ReturnValue_23, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue_1, class AGameStateBase* CallFunc_GetGameState_ReturnValue_14, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_14, bool K2Node_DynamicCast_bSuccess_20, int32 Temp_int_Loop_Counter_Variable_22, class APlayerState* CallFunc_Array_Get_Item_20, int32 CallFunc_Array_Length_ReturnValue_19, class AActor* CallFunc_GetOwner_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_17, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController_2, bool K2Node_DynamicCast_bSuccess_21, bool CallFunc_Less_IntInt_ReturnValue_18, int32 CallFunc_Add_IntInt_ReturnValue_24, class FText CallFunc_GetGameEndMVP_MVPName1, int32 CallFunc_GetGameEndMVP_CurrentHightScore1, int32 CallFunc_GetGameEndMVP_Currentkills1, int32 CallFunc_GetGameEndMVP_Currentdeaths1, const class FString& CallFunc_Conv_TextToString_ReturnValue_3, int32 CallFunc_GetTeamStats_CurrentHightScore1, int32 CallFunc_GetTeamStats_Currentkills1, int32 CallFunc_GetTeamStats_Currentdeaths1, int32 CallFunc_GetTeamStats_CurrentHightScore1_1, int32 CallFunc_GetTeamStats_Currentkills1_1, int32 CallFunc_GetTeamStats_Currentdeaths1_1, class AGameStateBase* CallFunc_GetGameState_ReturnValue_15, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_15, bool K2Node_DynamicCast_bSuccess_22, TArray<class ABP_SGKController_C*>& CallFunc_GetAllActorsOfClass_OutActors_12, class ABP_SGKController_C* CallFunc_Array_Get_Item_21, int32 CallFunc_Array_Length_ReturnValue_20, bool CallFunc_Less_IntInt_ReturnValue_19, int32 CallFunc_Array_Add_ReturnValue_5, class ABP_SGKController_C* CallFunc_Array_Get_Item_22, int32 CallFunc_Array_Length_ReturnValue_21, bool CallFunc_EqualEqual_IntInt_ReturnValue_4, bool CallFunc_CheckFFA_FFA_, class FText CallFunc_Conv_StringToText_ReturnValue_5, const struct FSlateColor& K2Node_MakeStruct_SlateColor_5, int32 Temp_int_Array_Index_Variable_23, class ABP_Landmine_C* CallFunc_Array_Get_Item_23, bool CallFunc_IsDedicatedServer_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue_16, class AGameStateBase* CallFunc_GetGameState_ReturnValue_17, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_16, bool K2Node_DynamicCast_bSuccess_23, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_17, bool K2Node_DynamicCast_bSuccess_24, const class FString& CallFunc_Array_Random_OutItem, int32 CallFunc_Array_Random_OutIndex, class APlayerState* CallFunc_Array_Get_Item_24, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, class AActor* CallFunc_GetOwner_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController_3, bool K2Node_DynamicCast_bSuccess_25, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, int32 CallFunc_Array_Length_ReturnValue_22, bool CallFunc_Less_IntInt_ReturnValue_20, int32 Temp_int_Loop_Counter_Variable_23, bool CallFunc_Less_IntInt_ReturnValue_21, int32 CallFunc_Add_IntInt_ReturnValue_25, class ABP_SGKController_C* CallFunc_Array_Get_Item_25, class ABP_SGKController_C* CallFunc_Array_Get_Item_26, class APawn* CallFunc_K2_GetPawn_ReturnValue, class APawn* CallFunc_K2_GetPawn_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_Array_RemoveItem_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_4, bool CallFunc_Array_RemoveItem_ReturnValue_5, int32 CallFunc_Array_Length_ReturnValue_23, bool CallFunc_Less_IntInt_ReturnValue_22, int32 CallFunc_Array_Length_ReturnValue_24, bool CallFunc_Less_IntInt_ReturnValue_23, bool K2Node_CustomEvent_PauseRoundEndChecks_1, bool K2Node_CustomEvent_PauseRoundEndChecks, class FName CallFunc_Get_Item_Drop_ResultRandomItem, bool CallFunc_NotEqual_NameName_ReturnValue, bool CallFunc_NotEqual_NameName_ReturnValue_1, const class FString& CallFunc_Conv_NameToString_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_2, int32 CallFunc_Conv_StringToInt_ReturnValue_3, class AGameStateBase* CallFunc_GetGameState_ReturnValue_18, class AGameStateBase* CallFunc_GetGameState_ReturnValue_19, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_18, bool K2Node_DynamicCast_bSuccess_26, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_19, bool K2Node_DynamicCast_bSuccess_27, class AGameStateBase* CallFunc_GetGameState_ReturnValue_20, class AGameStateBase* CallFunc_GetGameState_ReturnValue_21, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_20, bool K2Node_DynamicCast_bSuccess_28, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State_21, bool K2Node_DynamicCast_bSuccess_29, bool CallFunc_Array_IsEmpty_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_5, bool K2Node_SwitchEnum_CmpSuccess_2, bool CallFunc_Array_IsEmpty_ReturnValue_3, bool CallFunc_Array_IsEmpty_ReturnValue_4, bool CallFunc_Array_IsEmpty_ReturnValue_5);
};

}


