#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xE8 (0x360 - 0x278)
// WidgetBlueprintGeneratedClass GameLobbyWidget.GameLobbyWidget_C
class UGameLobbyWidget_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x278(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                               Border_Countdown;                                  // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MenuButton_C*                       Button_Loadout1;                                   // 0x288(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MenuButton_C*                       Button_Loadout2;                                   // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MenuButton_C*                       Button_Loadout3;                                   // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MenuButton_C*                       Button_Loadout4;                                   // 0x2A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MenuButton_C*                       Button_MainMenu;                                   // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MenuButton_C*                       Button_ready;                                      // 0x2B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MenuButton_C*                       Button_Start;                                      // 0x2B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MenuButton_C*                       Button_SwitchTeam;                                 // 0x2C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Countdown_Text;                                    // 0x2C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          CountdownBox;                                      // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image;                                             // 0x2D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_2;                                           // 0x2E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_86;                                          // 0x2E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_1255;                                        // 0x2F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          InsurgentsBox;                                     // 0x2F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          LeftPanelBox;                                      // 0x300(0x8)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          Loadouts;                                          // 0x308(0x8)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            LobbyText;                                         // 0x310(0x8)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            MapName;                                           // 0x318(0x8)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_lobby_lodout_screen_C*              Page_Loadout;                                      // 0x320(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              Page_PlayerList;                                   // 0x328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       PageSwitcher;                                      // 0x330(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          SealsBox;                                          // 0x338(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          VerticalBoxInsurgents;                             // 0x340(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          VerticalBoxSeals;                                  // 0x348(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                         SealsPriority;                                     // 0x350(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsReady;                                           // 0x351(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_51E7[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMediaPlayer*                          MediePlayer;                                       // 0x358(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UGameLobbyWidget_C* GetDefaultObj();

	void ForceLobbyToReady(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class APlayerState* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class ABP_SGKMenuController_C* K2Node_DynamicCast_AsBP_SGKMenu_Controller, bool K2Node_DynamicCast_bSuccess);
	class FText GetText_0(class UGameInstance* CallFunc_GetGameInstance_ReturnValue, class UBP_SGKGameInstance_C* K2Node_DynamicCast_AsBP_SGKGame_Instance, bool K2Node_DynamicCast_bSuccess, class FText CallFunc_Conv_BoolToText_ReturnValue);
	bool Get_Start_bIsEnabled(bool CallFunc_IsServer_ReturnValue);
	enum class ESlateVisibility GetVisibility_1();
	class UWidget* Get_Btn_Loadout4_ToolTipWidget(class UW_lobby_lodout_tooltip_C* CallFunc_Create_ReturnValue, class UClass* CallFunc_GetLodoutActor_Result1);
	class UWidget* Get_Btn_Loadout3_ToolTipWidget(class UW_lobby_lodout_tooltip_C* CallFunc_Create_ReturnValue, class UClass* CallFunc_GetLodoutActor_Result1);
	class UWidget* Get_Btn_Loadout2_ToolTipWidget(class UW_lobby_lodout_tooltip_C* CallFunc_Create_ReturnValue, class UClass* CallFunc_GetLodoutActor_Result1);
	class UWidget* Get_Btn_Loadout1_ToolTipWidget(class UW_lobby_lodout_tooltip_C* CallFunc_Create_ReturnValue, class UClass* CallFunc_GetLodoutActor_Result1);
	void GetLodoutActor(int32 InputPin, class UClass** Result1, class UClass* Result, bool K2Node_SwitchInteger_CmpSuccess, bool K2Node_SwitchInteger_CmpSuccess_1, bool K2Node_SwitchInteger_CmpSuccess_2, bool K2Node_SwitchInteger_CmpSuccess_3, bool K2Node_SwitchInteger_CmpSuccess_4, bool K2Node_SwitchInteger_CmpSuccess_5, bool K2Node_SwitchInteger_CmpSuccess_6, bool K2Node_SwitchInteger_CmpSuccess_7, bool K2Node_SwitchInteger_CmpSuccess_8, bool K2Node_SwitchInteger_CmpSuccess_9, bool K2Node_SwitchInteger_CmpSuccess_10, bool K2Node_SwitchInteger_CmpSuccess_11, bool K2Node_SwitchInteger_CmpSuccess_12, bool K2Node_SwitchInteger_CmpSuccess_13, bool K2Node_SwitchInteger_CmpSuccess_14, bool K2Node_SwitchInteger_CmpSuccess_15, bool K2Node_SwitchInteger_CmpSuccess_16, bool K2Node_SwitchInteger_CmpSuccess_17, bool K2Node_SwitchInteger_CmpSuccess_18, bool K2Node_SwitchInteger_CmpSuccess_19, bool K2Node_SwitchInteger_CmpSuccess_20, bool K2Node_SwitchInteger_CmpSuccess_21, bool K2Node_SwitchInteger_CmpSuccess_22, bool K2Node_SwitchInteger_CmpSuccess_23, bool K2Node_SwitchInteger_CmpSuccess_24, bool K2Node_SwitchInteger_CmpSuccess_25, bool K2Node_SwitchInteger_CmpSuccess_26, bool K2Node_SwitchInteger_CmpSuccess_27, bool K2Node_SwitchInteger_CmpSuccess_28, bool K2Node_SwitchInteger_CmpSuccess_29, bool K2Node_SwitchInteger_CmpSuccess_30, bool K2Node_SwitchInteger_CmpSuccess_31, bool K2Node_SwitchInteger_CmpSuccess_32, bool K2Node_SwitchInteger_CmpSuccess_33, bool K2Node_SwitchInteger_CmpSuccess_34, bool K2Node_SwitchInteger_CmpSuccess_35, bool K2Node_SwitchInteger_CmpSuccess_36, bool K2Node_SwitchInteger_CmpSuccess_37, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, class ABP_SGKMenuGameState_C* K2Node_DynamicCast_AsBP_SGKMenu_Game_State, bool K2Node_DynamicCast_bSuccess, class UBP_SGKGameInstance_C* K2Node_DynamicCast_AsBP_SGKGame_Instance, bool K2Node_DynamicCast_bSuccess_1, bool K2Node_SwitchString_CmpSuccess, bool K2Node_SwitchEnum_CmpSuccess, class AGameStateBase* CallFunc_GetGameState_ReturnValue_1, class ABP_SGKMenuGameState_C* K2Node_DynamicCast_AsBP_SGKMenu_Game_State_1, bool K2Node_DynamicCast_bSuccess_2, bool K2Node_SwitchString_CmpSuccess_1);
	class FText Get_TagNAme_Text(class APlayerController* CallFunc_GetPlayerController_ReturnValue, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController, bool K2Node_DynamicCast_bSuccess);
	class FText Get_PlayerName_Text_0(class UGameInstance* CallFunc_GetGameInstance_ReturnValue, class UBP_SGKGameInstance_C* K2Node_DynamicCast_AsBP_SGKGame_Instance, bool K2Node_DynamicCast_bSuccess, const class FString& CallFunc_Conv_TextToString_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue);
	bool Get_Btn_Loadout4_bIsEnabled(class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class ABP_SGKMenuController_C* K2Node_DynamicCast_AsBP_SGKMenu_Controller, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_IntInt_ReturnValue);
	bool Get_Btn_Loadout3_bIsEnabled(class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class ABP_SGKMenuController_C* K2Node_DynamicCast_AsBP_SGKMenu_Controller, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_IntInt_ReturnValue);
	bool Get_Btn_Loadout2_bIsEnabled(class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class ABP_SGKMenuController_C* K2Node_DynamicCast_AsBP_SGKMenu_Controller, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_IntInt_ReturnValue);
	bool Get_Btn_Loadout1_bIsEnabled(class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class ABP_SGKMenuController_C* K2Node_DynamicCast_AsBP_SGKMenu_Controller, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_IntInt_ReturnValue);
	enum class ESlateVisibility GetVisibility_0(class AGameStateBase* CallFunc_GetGameState_ReturnValue, class ABP_SGKMenuGameState_C* K2Node_DynamicCast_AsBP_SGKMenu_Game_State, bool K2Node_DynamicCast_bSuccess);
	enum class ESlateVisibility Get_LeftPanelBox_Visibility(class AGameStateBase* CallFunc_GetGameState_ReturnValue, class ABP_SGKMenuGameState_C* K2Node_DynamicCast_AsBP_SGKMenu_Game_State, bool K2Node_DynamicCast_bSuccess);
	class FText GetText(class AGameStateBase* CallFunc_GetGameState_ReturnValue, class ABP_SGKMenuGameState_C* K2Node_DynamicCast_AsBP_SGKMenu_Game_State, bool K2Node_DynamicCast_bSuccess, class FText CallFunc_Conv_IntToText_ReturnValue);
	class FText Get_PlayerName_Text(class AGameStateBase* CallFunc_GetGameState_ReturnValue, class ABP_SGKMenuGameState_C* K2Node_DynamicCast_AsBP_SGKMenu_Game_State, bool K2Node_DynamicCast_bSuccess, class FText CallFunc_Conv_StringToText_ReturnValue);
	class FText Get_PlayerName_1_Text(class AGameStateBase* CallFunc_GetGameState_ReturnValue, class ABP_SGKMenuGameState_C* K2Node_DynamicCast_AsBP_SGKMenu_Game_State, bool K2Node_DynamicCast_bSuccess, class FText CallFunc_Conv_StringToText_ReturnValue);
	void Construct();
	void UpdateLobby(TArray<class FName>& Name, TArray<enum class EPeak53Teams>& Team, TArray<bool>& Ready, TArray<int32>& Rank);
	void PressReady();
	void HandleOnLoadoutSet(class UClass* NewLodout);
	void ShowFullLobby();
	void ShowLoadoutPage();
	void BndEvt__GameLobbyWidget_Button_Loadout1_K2Node_ComponentBoundEvent_8_OnButtonClicked__DelegateSignature();
	void BndEvt__GameLobbyWidget_Button_Loadout2_K2Node_ComponentBoundEvent_9_OnButtonClicked__DelegateSignature();
	void BndEvt__GameLobbyWidget_Button_Loadout3_K2Node_ComponentBoundEvent_10_OnButtonClicked__DelegateSignature();
	void BndEvt__GameLobbyWidget_Button_Loadout4_K2Node_ComponentBoundEvent_11_OnButtonClicked__DelegateSignature();
	void BndEvt__GameLobbyWidget_Button_ready_K2Node_ComponentBoundEvent_12_OnButtonClicked__DelegateSignature();
	void BndEvt__GameLobbyWidget_Button_Start_K2Node_ComponentBoundEvent_14_OnButtonClicked__DelegateSignature();
	void BndEvt__GameLobbyWidget_Button_SwitchTeam_K2Node_ComponentBoundEvent_15_OnButtonClicked__DelegateSignature();
	void BndEvt__GameLobbyWidget_Button_MainMenu_K2Node_ComponentBoundEvent_17_OnButtonClicked__DelegateSignature();
	void ExecuteUbergraph_GameLobbyWidget(int32 EntryPoint, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, TArray<class FName>& K2Node_CustomEvent_Name, TArray<enum class EPeak53Teams>& K2Node_CustomEvent_Team, TArray<bool>& K2Node_CustomEvent_ready, TArray<int32>& K2Node_CustomEvent_rank, int32 CallFunc_Array_Length_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class UGameLobbyPlayerWidget_C* CallFunc_Create_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue_1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class ABP_SGKMenuController_C* K2Node_DynamicCast_AsBP_SGKMenu_Controller, bool K2Node_DynamicCast_bSuccess, class ABP_SGKMenuController_C* K2Node_DynamicCast_AsBP_SGKMenu_Controller_1, bool K2Node_DynamicCast_bSuccess_1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_2, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_3, class ABP_SGKMenuController_C* K2Node_DynamicCast_AsBP_SGKMenu_Controller_2, bool K2Node_DynamicCast_bSuccess_2, class ABP_SGKMenuController_C* K2Node_DynamicCast_AsBP_SGKMenu_Controller_3, bool K2Node_DynamicCast_bSuccess_3, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_4, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_5, class ABP_SGKMenuController_C* K2Node_DynamicCast_AsBP_SGKMenu_Controller_4, bool K2Node_DynamicCast_bSuccess_4, class ABP_SGKMenuController_C* K2Node_DynamicCast_AsBP_SGKMenu_Controller_5, bool K2Node_DynamicCast_bSuccess_5, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, class UBP_SGKGameInstance_C* K2Node_DynamicCast_AsBP_SGKGame_Instance, bool K2Node_DynamicCast_bSuccess_6, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue_1, class ABP_SGKMenuGameState_C* K2Node_DynamicCast_AsBP_SGKMenu_Game_State, bool K2Node_DynamicCast_bSuccess_7, class ABP_SGKMenuGameState_C* K2Node_DynamicCast_AsBP_SGKMenu_Game_State_1, bool K2Node_DynamicCast_bSuccess_8, bool CallFunc_Not_PreBool_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_6, class ABP_SGKMenuController_C* K2Node_DynamicCast_AsBP_SGKMenu_Controller_6, bool K2Node_DynamicCast_bSuccess_9, class UClass* K2Node_CustomEvent_NewLodout, class UClass* K2Node_ClassDynamicCast_AsBP_SGKMaster_Character, bool K2Node_ClassDynamicCast_bSuccess, int32 Temp_int_Array_Index_Variable, class FName CallFunc_Array_Get_Item, const class FString& CallFunc_Conv_NameToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, class FText CallFunc_Conv_NameToText_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Conv_BoolToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, bool K2Node_SwitchEnum_CmpSuccess, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_OpenSource_ReturnValue);
};

}


