#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x118 (0x390 - 0x278)
// WidgetBlueprintGeneratedClass MinimapInternal_Icon.MinimapInternal_Icon_C
class UMinimapInternal_Icon_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x278(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                Image_Icon;                                        // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMinimapInternal_IconMouseCapture_C*   Widget_MouseCapture;                               // 0x288(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMapIconComponent*                     MapIconComp;                                       // 0x290(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMapViewComponent*                     MapViewComp;                                       // 0x298(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMapTrackerComponent*                  MapTrackerComp;                                    // 0x2A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCanvasPanelSlot*                      CanvasSlot_Outer;                                  // 0x2A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                      CanvasSlot_Icon;                                   // 0x2B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                      CanvasSlot_MouseDetect;                            // 0x2B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          TickHandle;                                        // 0x2C0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         bIsShowingArrow;                                   // 0x2C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3AF2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstanceDynamic*              IconMatInst;                                       // 0x2D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              ArrowMatInst;                                      // 0x2D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMinimapInternal_Tooltip_C*            Tooltip;                                           // 0x2E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                       EffectStartTime;                                   // 0x2E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bIsCircular;                                       // 0x2F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_3AF3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             IconOuterRadiusUV;                                 // 0x2F8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             ArrowInnerRadiusUV;                                // 0x308(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                          Canvas_AboveFog;                                   // 0x318(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UCanvasPanel*                          Canvas_BelowFog;                                   // 0x320(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FGeometry                             MinimapGeo;                                        // 0x328(0x40)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	struct FVector2D                             MinimapSize;                                       // 0x368(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                       MinimapIconScale;                                  // 0x378(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnBoxSelect;                                       // 0x380(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

	static class UClass* StaticClass();
	static class UMinimapInternal_Icon_C* GetDefaultObj();

	void SetupBoxSelect(bool bEnableBoxSelect, const struct FLinearColor& BoxSelectColor);
	void InitSlots(class UCanvasPanelSlot* K2Node_DynamicCast_AsCanvas_Panel_Slot, bool K2Node_DynamicCast_bSuccess, class UCanvasPanelSlot* K2Node_DynamicCast_AsCanvas_Panel_Slot_1, bool K2Node_DynamicCast_bSuccess_1, class UCanvasPanelSlot* K2Node_DynamicCast_AsCanvas_Panel_Slot_2, bool K2Node_DynamicCast_bSuccess_2);
	void UpdateOuterCanvas(class UCanvasPanel* ParentCanvas, bool CallFunc_IsValid_ReturnValue, class UPanelWidget* CallFunc_GetParent_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class UCanvasPanelSlot* CallFunc_AddChildToCanvas_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool Temp_bool_Variable, enum class EIconFogInteraction CallFunc_GetIconFogInteraction_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class UCanvasPanel* K2Node_Select_Default);
	void UpdateTooltip(bool Temp_bool_Variable, class FText Temp_text_Variable, bool CallFunc_IsValid_ReturnValue, class FName CallFunc_GetIconTooltipText_ReturnValue, bool CallFunc_NotEqual_NameName_ReturnValue, class FText CallFunc_Conv_NameToText_ReturnValue, class FText K2Node_Select_Default);
	void SetTooltipShown(bool bNewShown, bool CallFunc_IsValid_ReturnValue, class UMinimapInternal_Tooltip_C* CallFunc_Create_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsInViewport_ReturnValue);
	struct FEventReply OnIconClicked(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void UpdateInteractability(bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, bool CallFunc_IsIconInteractable_ReturnValue, enum class ESlateVisibility K2Node_Select_Default);
	void UpdateMaterial(class UMaterialInterface* ArrowMaterialUMG, class UMaterialInterface* IconMaterialUMG, double CallFunc_GetGameTimeInSeconds_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UMaterialInstanceDynamic* CallFunc_CreateDynamicMaterialInstance_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_1, class UMaterialInterface* CallFunc_GetObjectiveArrowMaterialForUMG_ReturnValue, class UMaterialInterface* CallFunc_GetIconMaterialForUMG_ReturnValue);
	void UpdateAppearance(bool CallFunc_IsValid_ReturnValue);
	void UpdateVisibility(bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, bool CallFunc_IsIconVisible_ReturnValue, enum class ESlateVisibility K2Node_Select_Default);
	void TickIcon(bool IsSameLevel, class UMaterialInstanceDynamic* MatInst, const struct FVector& IconWorldLocation, enum class EIconFogInteraction FogInteraction, bool IsHiddenInFog, const struct FVector2D& RenderUV, double RenderYaw, bool IsRendered, bool IsAtEdge, bool IsInView, const struct FVector2D& UV, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_IsIconCategoryVisible_ReturnValue, bool CallFunc_IsSameBackgroundLevel_ReturnValue, double CallFunc_BreakVector2D_X, double CallFunc_BreakVector2D_Y, bool CallFunc_IsValid_ReturnValue, double CallFunc_BreakVector2D_X_1, double CallFunc_BreakVector2D_Y_1, double CallFunc_Multiply_DoubleDouble_ReturnValue, bool CallFunc_NotEqual_BoolBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, enum class EIconFogInteraction CallFunc_GetIconFogInteraction_ReturnValue, float CallFunc_GetIconFogRevealThreshold_ReturnValue, class UMapTrackerComponent* CallFunc_GetMapTracker_ReturnValue, bool CallFunc_GetFogRevealedFactor_bIsInsideFogVolume, float CallFunc_GetFogRevealedFactor_ReturnValue, TArray<enum class EIconFogInteraction>& K2Node_MakeArray_Array, bool CallFunc_Less_DoubleDouble_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, double CallFunc_GetGameTimeInSeconds_ReturnValue, bool CallFunc_DetectIsInView_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool Temp_bool_Variable, double CallFunc_BreakVector2D_X_2, double CallFunc_BreakVector2D_Y_2, class UMaterialInstanceDynamic* K2Node_Select_Default, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, const struct FVector2D& CallFunc_Subtract_Vector2DFloat_ReturnValue, double CallFunc_BreakVector2D_X_3, double CallFunc_BreakVector2D_Y_3, const struct FRotator& CallFunc_K2_GetComponentRotation_ReturnValue, double CallFunc_DegAtan2_ReturnValue, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, float CallFunc_GetViewYaw_Yaw, bool CallFunc_DoesObjectiveArrowRotate_ReturnValue, bool CallFunc_DoesIconRotate_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_4, bool CallFunc_BooleanAND_ReturnValue_5, bool CallFunc_IsObjectiveArrowEnabled_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_6, const struct FVector2D& CallFunc_ClampIntoView_ReturnValue, bool CallFunc_MarkRenderedInView_ReturnValue, float CallFunc_GetViewCoordinates_U, float CallFunc_GetViewCoordinates_V, bool CallFunc_GetViewCoordinates_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, bool CallFunc_IsIconVisible_ReturnValue, float CallFunc_ClampIntoView_OuterRadiusUV_ImplicitCast, double CallFunc_Less_DoubleDouble_B_ImplicitCast, double CallFunc_Less_DoubleDouble_A_ImplicitCast, float CallFunc_SetScalarParameterValue_Value_ImplicitCast, float CallFunc_SetScalarParameterValue_Value_ImplicitCast_1, double K2Node_VariableSet_RenderYaw_ImplicitCast, double CallFunc_MakeVector2D_X_ImplicitCast, double CallFunc_MakeVector2D_Y_ImplicitCast);
	void Precompute(double SizeTypeScale, const struct FVector2D& UVtoPixelRatio, double CallFunc_BreakVector2D_X, double CallFunc_BreakVector2D_Y, double CallFunc_BreakVector2D_X_1, double CallFunc_BreakVector2D_Y_1, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, enum class EIconSizeUnit CallFunc_GetIconSizeUnit_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, float CallFunc_GetViewExtent_ViewExtentX, float CallFunc_GetViewExtent_ViewExtentY, double CallFunc_Multiply_DoubleDouble_ReturnValue, float CallFunc_GetObjectiveArrowSize_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue_2, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, float CallFunc_GetIconSize_ReturnValue, const struct FVector2D& CallFunc_Multiply_Vector2DFloat_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_3, double CallFunc_Multiply_DoubleDouble_ReturnValue_4, double CallFunc_Multiply_DoubleDouble_ReturnValue_5, const struct FVector2D& CallFunc_Multiply_Vector2DFloat_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2);
	void UpdateSize(double BaseSize, double SizeTypeScale, double RotatableIconSize, bool CallFunc_IsValid_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, double CallFunc_BreakVector2D_X, double CallFunc_BreakVector2D_Y, double CallFunc_Multiply_DoubleDouble_ReturnValue, float CallFunc_GetViewExtent_ViewExtentX, float CallFunc_GetViewExtent_ViewExtentY, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_3, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, float CallFunc_GetObjectiveArrowSize_ReturnValue, float CallFunc_GetIconSize_ReturnValue, enum class EIconSizeUnit CallFunc_GetIconSizeUnit_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, double K2Node_VariableSet_BaseSize_ImplicitCast, double K2Node_VariableSet_BaseSize_ImplicitCast_1);
	void UpdateDrawColor(const struct FLinearColor& CallFunc_GetIconDrawColor_ReturnValue);
	void UpdateZOrder(int32 CallFunc_GetIconZOrder_ReturnValue);
	void UpdateArrow(bool Temp_bool_Variable, class UTexture2D* CallFunc_GetIconTexture_ReturnValue, class UTexture2D* CallFunc_GetObjectiveArrowTexture_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue, class UTexture2D* K2Node_Select_Default);
	void UpdateIcon(class UTexture2D* CallFunc_GetIconTexture_ReturnValue);
	void SetupListeners();
	void CleanupListeners();
	void OnIconDestroyed(class UMapIconComponent* MapIcon);
	void OnAppearanceChanged(class UMapIconComponent* MapIcon);
	void OnIconMaterialChanged(class UMapIconComponent* MapIcon);
	void OnViewSizeChanged_Event_0(class UMapViewComponent* MapView);
	void SetupViewListener();
	void CleanupViewListener();
	void Construct();
	void AlwaysTick();
	void Destruct();
	void OnMouseEnter(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	void OnMouseLeave(struct FPointerEvent& MouseEvent);
	void OnMouseClick_Event_0(bool IsLeftMouseButton);
	void ExecuteUbergraph_MinimapInternal_Icon(int32 EntryPoint, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class UMapIconComponent* K2Node_CustomEvent_MapIcon_2, class UMapIconComponent* K2Node_CustomEvent_MapIcon_1, class UMapIconComponent* K2Node_CustomEvent_MapIcon, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, bool CallFunc_IsValid_ReturnValue_4, class UMapViewComponent* K2Node_CustomEvent_MapView, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, const struct FGeometry& K2Node_Event_MyGeometry, const struct FPointerEvent& K2Node_Event_MouseEvent_1, const struct FPointerEvent& K2Node_Event_MouseEvent, bool K2Node_CustomEvent_IsLeftMouseButton, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5);
	void OnBoxSelect__DelegateSignature(const struct FVector2D& StartUV, const struct FVector2D& EndUV, bool IsLeftMouseButton, bool IsShiftSelect, bool IsCtrlSelect);
};

}


