#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x230 (0x5D8 - 0x3A8)
// BlueprintGeneratedClass Peak53PlayerState.Peak53PlayerState_C
class APeak53PlayerState_C : public APlayerState
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x3A8(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x3B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_SGKController_C*>           ControllerArray;                                   // 0x3B8(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class FText                                  PlayerName;                                        // 0x3C8(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class FText                                  PlayerTag;                                         // 0x3E0(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class FText                                  PlayerKills;                                       // 0x3F8(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class FText                                  PlayerDeaths;                                      // 0x410(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class FText                                  PlayerScore;                                       // 0x428(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify)
	enum class EPeak53Teams                      PlayerTeam;                                        // 0x440(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4A46[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  MessageToBeSendFeed;                               // 0x448(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify)
	class UClass*                                Loadout;                                           // 0x460(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                      UniqueNetID;                                       // 0x468(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSteamID                              SteamID;                                           // 0x498(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        SteamTotalKills;                                   // 0x4A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SteamTotalDeaths;                                  // 0x4A4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SteamTotalGamesWon;                                // 0x4A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SteamTotalGamesLost;                               // 0x4AC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NewGamesWon;                                       // 0x4B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        NewGamesLost;                                      // 0x4B4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_StartingWeaponItem>         WeaponsPrimary;                                    // 0x4B8(0x10)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<struct FS_StartingWeaponItem>         WeaponsSecondary;                                  // 0x4C8(0x10)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<struct FS_StartingWeaponItem>         WeaponsAll;                                        // 0x4D8(0x10)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	TArray<struct FS_CraftingCost>               WeaponsTool1;                                      // 0x4E8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_CraftingCost>               WeaponsTool2;                                      // 0x4F8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_CraftingCost>               WeaponsToolAll;                                    // 0x508(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  PlayerMVP;                                         // 0x518(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        SteamBombDefused;                                  // 0x530(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SteamBombPlanted;                                  // 0x534(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SteamHeadshots;                                    // 0x538(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SteamMVPAwards;                                    // 0x53C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  PlayerBombDefused;                                 // 0x540(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class FText                                  PlayerBombPlanted;                                 // 0x558(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class FText                                  PlayerHeadshots;                                   // 0x570(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	class FText                                  PlayerMVPAwards;                                   // 0x588(0x18)(Edit, BlueprintVisible, Net, DisableEditOnInstance)
	int32                                        SteamGlobalRank;                                   // 0x5A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SteamGlobalScore;                                  // 0x5A4(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HasBomb;                                           // 0x5A8(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsDead;                                            // 0x5A9(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4A47[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CurrentEquipmentString;                            // 0x5B0(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FSteamID                              SteamIDReplicated;                                 // 0x5C0(0x8)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                        SteamInventory;                                    // 0x5C8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class APeak53PlayerState_C* GetDefaultObj();

	void OnRep_MessageToBeSendFeed(class APlayerController* CallFunc_GetPlayerController_ReturnValue, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController, bool K2Node_DynamicCast_bSuccess, bool CallFunc_TextIsEmpty_ReturnValue, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class APeak53GameState_C* K2Node_DynamicCast_AsPeak_53Game_State, bool K2Node_DynamicCast_bSuccess_1);
	void OnRep_PlayerTeam(class APawn* CallFunc_GetPawn_ReturnValue, class ABP_SGKMasterCharacter_C* K2Node_DynamicCast_AsBP_SGKMaster_Character, bool K2Node_DynamicCast_bSuccess, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class ABP_SGKController_C* K2Node_DynamicCast_AsBP_SGKController, bool K2Node_DynamicCast_bSuccess_1);
