#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2D4 (0x494 - 0x1C0)
// BlueprintGeneratedClass PMM_Instance.PMM_Instance_C
class UPMM_Instance_C : public UGameInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x1C0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PMM_Savegame_C*                    PMM_SaveGame;                                      // 0x1C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         PMM_DoesSaveGameExist;                             // 0x1D0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4095[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBP_PMM_Savegame_C*                    PMM_LoadGame;                                      // 0x1D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                Savegame_Slot;                                     // 0x1E0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                Settings_General_Language;                         // 0x1F0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnGlobalGameSettingsApplied;                       // 0x200(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         IsProcessingApply;                                 // 0x210(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsProcessingSave;                                  // 0x211(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsProcessingLoad;                                  // 0x212(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4096[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UWB_Loading_C*                         LoadingWidget;                                     // 0x218(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnGlobalGameSettingsSaved;                         // 0x220(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnGlobalGameSettingsLoaded;                        // 0x230(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                       ProcessingDuration;                                // 0x240(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                Default_General_Language;                          // 0x248(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                         IsProcessingResetDefault_General;                  // 0x258(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4097[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnResetDefaults_GeneralSettings;                   // 0x260(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnResetDefaults_ControlSettings;                   // 0x270(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnResetDefaults_InputSettings;                     // 0x280(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnResetDefaults_AudioSettings;                     // 0x290(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnResetDefaults_VideoSettings;                     // 0x2A0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnSetDefaultsCompleted;                            // 0x2B0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         IsProcessingResetDefault_Control;                  // 0x2C0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4098[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Settings_Control_MouseSen;                         // 0x2C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Default_Control_MouseSen;                          // 0x2D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Default_Control_GamepadSen;                        // 0x2D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Settings_Control_GamepadSen;                       // 0x2E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Default_Control_InvMouse;                          // 0x2E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Default_Control_InvGamepad;                        // 0x2E9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Settings_Control_InvMouse;                         // 0x2EA(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Settings_Control_InvGamepad;                       // 0x2EB(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4099[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, class FText>               Default_Input_Mappings;                            // 0x2F0(0x50)(Edit, BlueprintVisible)
	TMap<class FName, double>                    Settings_Input_AxisMappingValueMap;                // 0x340(0x50)(Edit, BlueprintVisible)
	TMap<class FName, struct FKey>               Settings_Input_Mappings;                           // 0x390(0x50)(Edit, BlueprintVisible)
	TMap<class FName, class FText>               Default_Input_Mappings_Info;                       // 0x3E0(0x50)(Edit, BlueprintVisible)
	bool                                         IsProcessingResetDefault_Video;                    // 0x430(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EWindowMode                       Default_FullscreenMode;                            // 0x431(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsProcessingResetDefault_Audio;                    // 0x432(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_409A[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Default_Audio_MasterVolume;                        // 0x438(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Default_Audio_SFX_Volume;                          // 0x440(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Default_Audio_MusicVolume;                         // 0x448(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Default_Audio_DialogueVolume;                      // 0x450(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Settings_Audio_MasterVolume;                       // 0x458(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Settings_Audio_SFX_Volume;                         // 0x460(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Settings_Audio_MusicVolume;                        // 0x468(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Settings_Audio_DialogueVolume;                     // 0x470(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Default_Audio_MusicOn;                             // 0x478(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Settings_Audio_MusicOn;                            // 0x479(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_409B[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Default_Audio_MusicOffVolume;                      // 0x480(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsRunning;                                         // 0x488(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EWindowMode                       LastConfirmedFullscreenMode;                       // 0x489(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_409C[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FIntPoint                             LastConfirmedScreenResolution;                     // 0x48C(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UPMM_Instance_C* GetDefaultObj();

	void GetDefaultAxisActionMappingNames(TArray<class FName>* AxisNames, TArray<class FName>* ActionNames, const TArray<class FName>& OutActionNames, const TArray<class FName>& OutAxisNames, TSet<class FName> InDefaultMappingNames, TSet<class FName> InActionNames, TSet<class FName> InAxisNames, TSet<class FName> CallFunc_Set_Intersection_Result, TArray<class FName>& CallFunc_Set_ToArray_Result, TSet<class FName> CallFunc_Set_Intersection_Result_1, TArray<class FName>& CallFunc_Set_ToArray_Result_1, class UInputSettings* CallFunc_GetInputSettings_ReturnValue, TArray<class FName>& CallFunc_GetActionNames_ActionNames, TArray<class FName>& CallFunc_GetDefaultInputMappingNames_Keys, class UInputSettings* CallFunc_GetInputSettings_ReturnValue_1, TArray<class FName>& CallFunc_GetAxisNames_AxisNames);
	void FindDefaultAxisMappingNames(TArray<class FName>* Result, TSet<class FName> AxisNames_Set, TSet<class FName> DefaultMappings_Set, TSet<class FName> CallFunc_Set_Intersection_Result, TArray<class FName>& CallFunc_Set_ToArray_Result, TArray<class FName>& CallFunc_GetDefaultInputMappingNames_Keys, class UInputSettings* CallFunc_GetInputSettings_ReturnValue, TArray<class FName>& CallFunc_GetAxisNames_AxisNames);
	void GetDefaultInputMappingNames(TArray<class FName>* Keys, TArray<class FName>& CallFunc_Map_Keys_Keys);
	void RemoveLoadingWidget(bool CallFunc_IsValid_ReturnValue);
	void CreateLoadingWidget(int32 ZOrder, class UWB_Loading_C* CallFunc_Create_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void HandleTravelError(enum class ETravelFailure FailureType);
	void HandleNetworkError(enum class ENetworkFailure FailureType, bool bIsServer);
	void ReceiveInit();
	void ApplySettings();
	void SaveSettings(bool ContinueWithApply);
	void LoadSettings(bool ContinueWithApply);
	void ResetDefaults_GeneralSettings(bool ContinueWithSave);
	void SetDefaultSettings();
	void ResetDefaults_ControlSettings(bool ContinueWithSave);
	void ResetDefaults_AudioSettings(bool ContinueWithSave);
	void ResetDefaults_VideoSettings(bool ContinueWithSave);
	void ResetDefaults_InputSettings(bool ContinueWithSave);
	void OnGlobalGameSettingsSaved_Event();
	void CacheLastConfirmedVideoMode();
	void CustomEvent_0(bool Confirmed);
	void CustomEvent(bool Confirmed);
	void OnResetDefaultsCompleted_Event();
	void OnGlobalGameSettingsLoaded_Event();
	void OnVideoSettingsReset();
	void OnAudioSettingsReset();
	void OnControlSettingsReset();
	void OnGeneralSettingsReset();
	void ExecuteUbergraph_PMM_Instance(int32 EntryPoint, class FText Temp_text_Variable, bool CallFunc_SetCurrentLanguageAndLocale_ReturnValue, class FText Temp_text_Variable_1, class FText Temp_text_Variable_2, class FText Temp_text_Variable_3, class FText Temp_text_Variable_4, enum class ENetworkFailure Temp_byte_Variable, const struct FIntPoint& CallFunc_GetDesktopResolution_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, bool CallFunc_PMM_DoesSaveGameExist_ReturnValue, class FText Temp_text_Variable_5, class FText Temp_text_Variable_6, class FText Temp_text_Variable_7, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, class FText Temp_text_Variable_8, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, class FText Temp_text_Variable_9, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable_2, int32 Temp_int_Loop_Counter_Variable_3, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Array_Index_Variable_3, class FText Temp_text_Variable_10, int32 Temp_int_Loop_Counter_Variable_4, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 Temp_int_Array_Index_Variable_4, class FText Temp_text_Variable_11, int32 Temp_int_Loop_Counter_Variable_5, int32 CallFunc_Add_IntInt_ReturnValue_5, int32 Temp_int_Array_Index_Variable_5, int32 Temp_int_Loop_Counter_Variable_6, int32 CallFunc_Add_IntInt_ReturnValue_6, int32 Temp_int_Array_Index_Variable_6, class FText Temp_text_Variable_12, class FText Temp_text_Variable_13, class FText Temp_text_Variable_14, class UBP_PMM_Savegame_C* CallFunc_PMM_LoadGame_AsBP_PMM_Savegame, class FText Temp_text_Variable_15, class FText Temp_text_Variable_16, enum class ETravelFailure Temp_byte_Variable_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, enum class ETravelFailure K2Node_Event_FailureType_1, enum class ENetworkFailure K2Node_Event_FailureType, bool K2Node_Event_bIsServer, class FText K2Node_Select_Default, class FText CallFunc_MakeLiteralText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, bool K2Node_CustomEvent_ContinueWithApply_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, bool K2Node_CustomEvent_ContinueWithApply, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, bool K2Node_CustomEvent_ContinueWithSave_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, bool CallFunc_PMM_SaveGame_ReturnValue, bool K2Node_CustomEvent_ContinueWithSave_3, bool K2Node_CustomEvent_ContinueWithSave_2, bool K2Node_CustomEvent_ContinueWithSave_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, class UBP_PMM_Savegame_C* CallFunc_PMM_GetSaveGameObject_ReturnValue, bool K2Node_CustomEvent_ContinueWithSave, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, enum class EWindowMode CallFunc_GetLastConfirmedFullscreenMode_ReturnValue, const struct FIntPoint& CallFunc_GetLastConfirmedScreenResolution_ReturnValue, bool K2Node_CustomEvent_Confirmed_1, class FText CallFunc_MakeLiteralText_ReturnValue_1, bool Temp_bool_Variable, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, double K2Node_Select_Default_1, class FText CallFunc_Format_ReturnValue, class UWB_Request_C* CallFunc_CreateRequest_ReturnValue, bool K2Node_CustomEvent_Confirmed, class FText CallFunc_MakeLiteralText_ReturnValue_2, class FText Temp_text_Variable_17, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, class FText Temp_text_Variable_18, bool CallFunc_PMM_DoesSaveGameExist_ReturnValue_1, class FText Temp_text_Variable_19, class UInputSettings* CallFunc_GetInputSettings_ReturnValue, TArray<class FName>& CallFunc_FindDefaultAxisMappingNames_Result, class FName CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, TArray<struct FInputAxisKeyMapping>& CallFunc_GetAxisMappingByName_OutMappings, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class UInputSettings* CallFunc_GetInputSettings_ReturnValue_1, class UInputSettings* CallFunc_GetInputSettings_ReturnValue_2, class UInputSettings* CallFunc_GetInputSettings_ReturnValue_3, TArray<class FName>& CallFunc_GetAxisNames_AxisNames, class FText Temp_text_Variable_20, TArray<class FName>& CallFunc_Map_Keys_Keys, class FName CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, double CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, const struct FKey& CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, const struct FInputAxisKeyMapping& K2Node_MakeStruct_InputAxisKeyMapping, TArray<struct FInputAxisKeyMapping>& CallFunc_GetAxisMappingByName_OutMappings_1, const struct FInputAxisKeyMapping& CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_2, bool CallFunc_Array_Contains_ReturnValue, class UInputSettings* CallFunc_GetInputSettings_ReturnValue_4, class UInputSettings* CallFunc_GetInputSettings_ReturnValue_5, class UInputSettings* CallFunc_GetInputSettings_ReturnValue_6, TArray<class FName>& CallFunc_GetActionNames_ActionNames, bool Temp_bool_Variable_1, TArray<class FName>& CallFunc_Map_Keys_Keys_1, class FName CallFunc_Array_Get_Item_3, double K2Node_Select_Default_2, const struct FKey& CallFunc_Map_Find_Value_2, bool CallFunc_Map_Find_ReturnValue_2, const struct FInputActionKeyMapping& K2Node_MakeStruct_InputActionKeyMapping, TArray<struct FInputActionKeyMapping>& CallFunc_GetActionMappingByName_OutMappings, const struct FInputActionKeyMapping& CallFunc_Array_Get_Item_4, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_3, bool CallFunc_Array_Contains_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_4, bool CallFunc_PMM_DoesSaveGameExist_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_4, class FText Temp_text_Variable_21, class UInputSettings* CallFunc_GetInputSettings_ReturnValue_7, class FText Temp_text_Variable_22, class UInputSettings* CallFunc_GetInputSettings_ReturnValue_8, TArray<class FName>& CallFunc_GetDefaultAxisActionMappingNames_AxisNames, TArray<class FName>& CallFunc_GetDefaultAxisActionMappingNames_ActionNames, class FText K2Node_Select_Default_3, class FName CallFunc_Array_Get_Item_5, class FText CallFunc_MakeLiteralText_ReturnValue_3, TArray<struct FInputActionKeyMapping>& CallFunc_GetActionMappingByName_OutMappings_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue_1, class UWB_Request_C* CallFunc_CreateRequest_ReturnValue_1, bool CallFunc_Array_IsValidIndex_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_5, class FName CallFunc_Array_Get_Item_6, bool CallFunc_Less_IntInt_ReturnValue_5, TArray<struct FInputAxisKeyMapping>& CallFunc_GetAxisMappingByName_OutMappings_2, bool CallFunc_Array_IsValidIndex_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue_6, bool CallFunc_Less_IntInt_ReturnValue_6, float CallFunc_Delay_Duration_ImplicitCast, float CallFunc_Delay_Duration_ImplicitCast_1, float CallFunc_Delay_Duration_ImplicitCast_2, float CallFunc_Delay_Duration_ImplicitCast_3, float CallFunc_Delay_Duration_ImplicitCast_4, float CallFunc_Delay_Duration_ImplicitCast_5, float CallFunc_Delay_Duration_ImplicitCast_6, float CallFunc_Delay_Duration_ImplicitCast_7, float CallFunc_Delay_Duration_ImplicitCast_8, float CallFunc_Delay_Duration_ImplicitCast_9, float CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast, float CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_1, float CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_2, float CallFunc_Delay_Duration_ImplicitCast_10, float CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_3, float CallFunc_Delay_Duration_ImplicitCast_11, float CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_4, float CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_5, float CallFunc_Delay_Duration_ImplicitCast_12, float CallFunc_Delay_Duration_ImplicitCast_13, float CallFunc_Delay_Duration_ImplicitCast_14, float CallFunc_Delay_Duration_ImplicitCast_15, float CallFunc_Delay_Duration_ImplicitCast_16, float CallFunc_Delay_Duration_ImplicitCast_17, float CallFunc_Delay_Duration_ImplicitCast_18, float CallFunc_Delay_Duration_ImplicitCast_19, float CallFunc_Delay_Duration_ImplicitCast_20, float CallFunc_Delay_Duration_ImplicitCast_21, float CallFunc_Delay_Duration_ImplicitCast_22, float CallFunc_Delay_Duration_ImplicitCast_23, float CallFunc_Delay_Duration_ImplicitCast_24, float CallFunc_Delay_Duration_ImplicitCast_25, float CallFunc_Delay_Duration_ImplicitCast_26, float CallFunc_Delay_Duration_ImplicitCast_27, float CallFunc_Delay_Duration_ImplicitCast_28, float CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_6, float CallFunc_Delay_Duration_ImplicitCast_29, float CallFunc_Delay_Duration_ImplicitCast_30, double CallFunc_Map_Add_Value_ImplicitCast, float K2Node_MakeStruct_Scale_ImplicitCast, float CallFunc_Delay_Duration_ImplicitCast_31, float CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_7, float CallFunc_Delay_Duration_ImplicitCast_32);
	void OnResetDefaults_InputSettings__DelegateSignature();
	void OnSetDefaultsCompleted__DelegateSignature();
	void OnResetDefaults_VideoSettings__DelegateSignature();
	void OnResetDefaults_AudioSettings__DelegateSignature();
	void OnResetDefaults_ControlSettings__DelegateSignature();
	void OnResetDefaults_GeneralSettings__DelegateSignature();
	void OnGlobalGameSettingsLoaded__DelegateSignature();
	void OnGlobalGameSettingsSaved__DelegateSignature();
	void OnGlobalGameSettingsApplied__DelegateSignature();
};

}


