#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x40 (0x40 - 0x0)
// UserDefinedStruct S_Frame_Textures.S_Frame_Textures
struct FS_Frame_Textures
{
public:
	class UTexture2D*                            TopLeft_3_B283F0E5459B0781BF929EAB27AA5C04;        // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            Top_5_0101867346E43D65BC4DD7A77CDB7DEB;            // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            TopRight_7_D25D35FE4206DD7BA2E65E8FE6BD851E;       // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            Right_9_B18C99C2433CBAEA7BEA43910F8F41F2;          // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            BottomRight_11_6F3820E84D3A0B97F35BCA918B6BFFE8;   // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            Bottom_13_0A891F3C48BC7BF65C4CC89E4E6C9010;        // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            BottomLeft_15_1EB5D82C4600E85FBAC17F948344B0E0;    // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            Left_17_668472A44C2C5BFFFAAE31B597E84F77;          // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}


