#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xC8 (0x3A8 - 0x2E0)
// WidgetBlueprintGeneratedClass WB_Child_AudioSettings.WB_Child_AudioSettings_C
class UWB_Child_AudioSettings_C : public UWB_Child_Base_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2E0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWB_Button_State_C*                    Button_AudioDevice;                                // 0x2E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Slider_C*                   Button_DialogueVolume;                             // 0x2F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Slider_C*                   Button_MasterVolume;                               // 0x2F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_State_C*                    Button_MusicOn;                                    // 0x300(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Slider_C*                   Button_MusicVolume;                                // 0x308(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Button_Slider_C*                   Button_SFX_Volume;                                 // 0x310(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Infofield_C*                       Info_Field;                                        // 0x318(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                   InputSwitchListener;                               // 0x320(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          VB_Buttons;                                        // 0x328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                         bUsingGamepad;                                     // 0x330(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2612[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NewState_Language;                                 // 0x334(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CurrentState_Language;                             // 0x338(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2619[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Current_Audio_MasterVol;                           // 0x340(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       New_Audio_MasterVol;                               // 0x348(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Current_Audio_SFX;                                 // 0x350(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       New_Audio_SFX;                                     // 0x358(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Current_Audio_Music;                               // 0x360(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       New_Audio_Music;                                   // 0x368(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Current_Audio_Dialogue;                            // 0x370(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       New_Audio_Dialogue;                                // 0x378(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Current_MusicOn;                                   // 0x380(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         New_MusicOn;                                       // 0x381(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_261A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAudioOutputDeviceInfo>        FoundOutputDevices;                                // 0x388(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                        OutputDevicesString;                               // 0x398(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UWB_Child_AudioSettings_C* GetDefaultObj();

	void GetMusicOffVolume(double* Value, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance);
	void SetAudioButtonValue(class UWB_Button_Slider_C* Button, float InValue, double CallFunc_FClamp_ReturnValue, double CallFunc_MapRangeClamped_ReturnValue, double CallFunc_FClamp_Value_ImplicitCast, float CallFunc_SetSliderValue_InValue_ImplicitCast);
	int32 GetLanguageButton_State(bool Temp_bool_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, bool Temp_bool_Variable_1, int32 Temp_int_Variable_2, bool Temp_bool_Variable_2, int32 Temp_int_Variable_3, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance, bool CallFunc_EqualEqual_StrStr_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue_1, bool CallFunc_EqualEqual_StrStr_ReturnValue_2, int32 K2Node_Select_Default, int32 K2Node_Select_Default_1, int32 K2Node_Select_Default_2);
	void BindPanelWidgetChildren_ButtonOnUnhovered(class UPanelWidget* Panel_Widget, bool Bind_Unbind, FDelegateProperty_& EventToBind, int32 Temp_int_Array_Index_Variable, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UCommonButtonBase* K2Node_DynamicCast_AsCommon_Button_Base, bool K2Node_DynamicCast_bSuccess, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);
	void BindPanelWidgetChildren_ButtonOnHovered(class UPanelWidget* Panel_Widget, bool Bind_Unbind, FDelegateProperty_& EventToBind, int32 Temp_int_Array_Index_Variable, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UCommonButtonBase* K2Node_DynamicCast_AsCommon_Button_Base, bool K2Node_DynamicCast_bSuccess, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);
	void GetStateButtonInfo(class UCommonButtonBase* Button, class FText* Head, class FText* Body, class UWB_Button_Slider_C* K2Node_DynamicCast_AsWB_Button_Slider, bool K2Node_DynamicCast_bSuccess, class UWB_Button_State_C* K2Node_DynamicCast_AsWB_Button_State, bool K2Node_DynamicCast_bSuccess_1);
	void Construct();
	void OnInputMethodChanged(bool bUsingGamepad);
	void SetInfoFieldInfo(class FText Head, class FText Body);
	void OnAnyButtonHovered(class UCommonButtonBase* Button);
	void OnAnyButtonUnhovered(class UCommonButtonBase* Button);
	void SetupButtons();
	void OnApplyChanges();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnResetDefaults();
	void OnResetDefaultsFinished();
	void BndEvt__WB_Child_AudioSettings_Button_MasterVolume_K2Node_ComponentBoundEvent_0_OnValueChanged__DelegateSignature(class UWB_Button_Slider_C* Button, double Value);
	void BndEvt__WB_Child_AudioSettings_Button_MusicOn_K2Node_ComponentBoundEvent_4_OnStateChanged__DelegateSignature(class UWB_Button_State_C* Button, int32 NewState);
	void BndEvt__WB_Child_AudioSettings_Button_DialogueVolume_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature(class UWB_Button_Slider_C* Button, double Value);
	void BndEvt__WB_Child_AudioSettings_Button_SFX_Volume_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature(class UWB_Button_Slider_C* Button, double Value);
	void BndEvt__WB_Child_AudioSettings_Button_MusicVolume_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature(class UWB_Button_Slider_C* Button, double Value);
	void CustomEvent_2(struct FSwapAudioOutputResult& SwapResult);
	void BndEvt__WB_Child_AudioSettings_Button_AudioDevice_K2Node_ComponentBoundEvent_0_OnStateChanged__DelegateSignature(class UWB_Button_State_C* Button, int32 NewState);
	void OnAvailableAudioOutputDevicesFound(TArray<struct FAudioOutputDeviceInfo>& AvailableDevices);
	void CustomEvent_3(const class FString& CurrentDevice);
	void ExecuteUbergraph_WB_Child_AudioSettings(int32 EntryPoint, bool Temp_bool_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 K2Node_Select_Default, int32 CallFunc_Array_Length_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, bool CallFunc_HasAnyChildren_ReturnValue, class UWidget* CallFunc_GetChildAt_ReturnValue, bool K2Node_Event_bUsingGamepad, class FText K2Node_CustomEvent_Head, class FText K2Node_CustomEvent_Body, bool CallFunc_TextIsEmpty_ReturnValue, bool CallFunc_TextIsEmpty_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable, class UCommonButtonBase* K2Node_CustomEvent_Button_1, class FText CallFunc_GetStateButtonInfo_Head, class FText CallFunc_GetStateButtonInfo_Body, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class UCommonButtonBase* K2Node_CustomEvent_Button, bool CallFunc_Not_PreBool_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance_1, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance_2, class UWB_Button_Slider_C* K2Node_ComponentBoundEvent_Button_5, double K2Node_ComponentBoundEvent_Value_3, double CallFunc_MapRangeClamped_ReturnValue, class UWB_Button_State_C* K2Node_ComponentBoundEvent_Button_4, int32 K2Node_ComponentBoundEvent_NewState_1, class UWB_Button_Slider_C* K2Node_ComponentBoundEvent_Button_3, double K2Node_ComponentBoundEvent_Value_2, class UWB_Button_Slider_C* K2Node_ComponentBoundEvent_Button_2, double K2Node_ComponentBoundEvent_Value_1, double CallFunc_MapRangeClamped_ReturnValue_1, double CallFunc_MapRangeClamped_ReturnValue_2, class UWB_Button_Slider_C* K2Node_ComponentBoundEvent_Button_1, double K2Node_ComponentBoundEvent_Value, double CallFunc_MapRangeClamped_ReturnValue_3, bool Temp_bool_IsClosed_Variable, bool Temp_bool_Variable_1, double CallFunc_GetMusicOffVolume_Value, double CallFunc_GetMusicOffVolume_Value_1, const struct FSwapAudioOutputResult& K2Node_CustomEvent_SwapResult, class UWB_Button_State_C* K2Node_ComponentBoundEvent_Button, int32 K2Node_ComponentBoundEvent_NewState, bool K2Node_SwitchEnum_CmpSuccess, int32 Temp_int_Array_Index_Variable, bool Temp_bool_Variable_2, const struct FAudioOutputDeviceInfo& CallFunc_Array_Get_Item, class FText CallFunc_Conv_StringToText_ReturnValue, class UWidget* CallFunc_GetChildAt_ReturnValue_1, bool CallFunc_HasAnyChildren_ReturnValue_1, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance_3, int32 Temp_int_Variable_2, bool K2Node_Select_Default_1, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance_4, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance_5, bool Temp_bool_Has_Been_Initd_Variable_1, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance_6, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance_7, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance_8, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance_9, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance_10, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance_11, bool CallFunc_NotEqual_BoolBool_ReturnValue, bool CallFunc_NotEqual_DoubleDouble_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, bool CallFunc_NotEqual_DoubleDouble_ReturnValue_1, bool Temp_bool_Variable_3, bool CallFunc_NotEqual_DoubleDouble_ReturnValue_2, double K2Node_Select_Default_2, bool CallFunc_NotEqual_DoubleDouble_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_3, class UPMM_Instance_C* CallFunc_Get_PMM_Instance_AsPMM_Instance_12, bool Temp_bool_IsClosed_Variable_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, int32 CallFunc_Array_Add_ReturnValue, const class FString& CallFunc_JoinStringArray_ReturnValue, bool Temp_bool_Variable_4, const class FString& CallFunc_Concat_StrStr_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue_1, double K2Node_Select_Default_3, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, TArray<struct FAudioOutputDeviceInfo>& K2Node_CustomEvent_AvailableDevices, const class FString& K2Node_CustomEvent_CurrentDevice, class FText CallFunc_Conv_StringToText_ReturnValue_2, int32 CallFunc_Array_Find_ReturnValue, float CallFunc_SetAudioButtonValue_InValue_ImplicitCast, float CallFunc_SetAudioButtonValue_InValue_ImplicitCast_1, float CallFunc_SetAudioButtonValue_InValue_ImplicitCast_2, float CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast, float CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_1, float CallFunc_SetAudioButtonValue_InValue_ImplicitCast_3, float CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_2, float CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_3, float CallFunc_SetSoundMixClassOverride_Volume_ImplicitCast_4);
};

}


