#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x159 (0x3F9 - 0x2A0)
// WidgetBlueprintGeneratedClass WB_Frame.WB_Frame_C
class UWB_Frame_C : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2A0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                              B;                                                 // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               B_B;                                               // 0x2B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               B_BL;                                              // 0x2B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               B_BR;                                              // 0x2C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               B_Color;                                           // 0x2C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               B_L;                                               // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               B_R;                                               // 0x2D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               B_T;                                               // 0x2E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               B_TL;                                              // 0x2E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               B_TR;                                              // 0x2F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              BL;                                                // 0x2F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              BR;                                                // 0x300(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              L;                                                 // 0x308(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              R;                                                 // 0x310(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              SB_Container;                                      // 0x318(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              T;                                                 // 0x320(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              TL;                                                // 0x328(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              TR;                                                // 0x330(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                             FrameSize;                                         // 0x338(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                          FrameColor;                                        // 0x348(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FrameThickness;                                    // 0x358(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_FrameLayer                         FrameLayerInfo;                                    // 0x360(0x98)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	enum class EFrameAlignment                   Frame_Alignment;                                   // 0x3F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UWB_Frame_C* GetDefaultObj();

	void SetBorderBrush(class UBorder* Border, class UObject* Brush, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush);
	void SetAlignment(enum class EHorizontalAlignment InHorizontalAlignment, enum class EVerticalAlignment InVerticalAlignment, class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue);
	void SetFrameBrushes();
	void SetContainerSize(bool CallFunc_NotEqual_Vector2DVector2D_ReturnValue);
	void SetFrameThickness(int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_2, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_BreakVector2D_X, double CallFunc_BreakVector2D_Y, double CallFunc_Subtract_DoubleDouble_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_2, double CallFunc_BreakVector2D_X_1, double CallFunc_BreakVector2D_Y_1, double CallFunc_Subtract_DoubleDouble_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, TArray<class USizeBox*>& K2Node_MakeArray_Array, class USizeBox* CallFunc_Array_Get_Item, TArray<class USizeBox*>& K2Node_MakeArray_Array_1, class USizeBox* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_2, TArray<class USizeBox*>& K2Node_MakeArray_Array_2, int32 CallFunc_Array_Length_ReturnValue_2, class USizeBox* CallFunc_Array_Get_Item_2, bool CallFunc_Less_IntInt_ReturnValue_2);
	void SetSizeBoxSize(class USizeBox* SizeBox, const struct FVector2D& Size, double CallFunc_BreakVector2D_X, double CallFunc_BreakVector2D_Y, float CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast, float CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast);
	void BaseConstruct();
	void ExecuteUbergraph_WB_Frame(int32 EntryPoint, enum class EFrameAlignment Temp_byte_Variable, double Temp_real_Variable, enum class EFrameAlignment Temp_byte_Variable_1, double Temp_real_Variable_1, enum class EFrameAlignment Temp_byte_Variable_2, double Temp_real_Variable_2, enum class EFrameAlignment Temp_byte_Variable_3, enum class EFrameAlignment Temp_byte_Variable_4, double Temp_real_Variable_3, enum class EFrameAlignment Temp_byte_Variable_5, double Temp_real_Variable_4, enum class EFrameAlignment Temp_byte_Variable_6, enum class EFrameAlignment Temp_byte_Variable_7, double Temp_real_Variable_5, enum class EFrameAlignment Temp_byte_Variable_8, double Temp_real_Variable_6, enum class EFrameAlignment Temp_byte_Variable_9, double Temp_real_Variable_7, enum class EFrameAlignment Temp_byte_Variable_10, double Temp_real_Variable_8, enum class EFrameAlignment Temp_byte_Variable_11, double Temp_real_Variable_9, bool Temp_bool_Variable, bool Temp_bool_Variable_1, const struct FLinearColor& CallFunc_GetGlobalColorByType_ReturnValue, const struct FLinearColor& K2Node_Select_Default, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, double Temp_real_Variable_10, int32 CallFunc_Add_IntInt_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, TArray<class USizeBox*>& K2Node_MakeArray_Array, class USizeBox* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue_1, double K2Node_Select_Default_1, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, double CallFunc_Divide_DoubleDouble_ReturnValue_2, double K2Node_Select_Default_2, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, double CallFunc_Divide_DoubleDouble_ReturnValue_3, double CallFunc_Multiply_DoubleDouble_ReturnValue_3, double K2Node_Select_Default_3, double CallFunc_Multiply_DoubleDouble_ReturnValue_4, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_2, double CallFunc_BreakVector2D_X, double CallFunc_BreakVector2D_Y, double CallFunc_Subtract_DoubleDouble_ReturnValue, double CallFunc_BreakVector2D_X_1, double CallFunc_BreakVector2D_Y_1, double CallFunc_BreakVector2D_X_2, double CallFunc_BreakVector2D_Y_2, double CallFunc_Subtract_DoubleDouble_ReturnValue_1, double K2Node_Select_Default_4, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_3, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_4, double CallFunc_Divide_DoubleDouble_ReturnValue_4, double CallFunc_Divide_DoubleDouble_ReturnValue_5, double K2Node_Select_Default_5, double K2Node_Select_Default_6, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_5, double CallFunc_Multiply_DoubleDouble_ReturnValue_5, double CallFunc_BreakVector2D_X_3, double CallFunc_BreakVector2D_Y_3, double CallFunc_Subtract_DoubleDouble_ReturnValue_2, double CallFunc_BreakVector2D_X_4, double CallFunc_BreakVector2D_Y_4, double CallFunc_BreakVector2D_X_5, double CallFunc_BreakVector2D_Y_5, double CallFunc_Subtract_DoubleDouble_ReturnValue_3, double K2Node_Select_Default_7, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_6, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_7, double CallFunc_Divide_DoubleDouble_ReturnValue_6, double K2Node_Select_Default_8, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_8, double CallFunc_Multiply_DoubleDouble_ReturnValue_6, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_9, double CallFunc_Multiply_DoubleDouble_ReturnValue_7, double CallFunc_Divide_DoubleDouble_ReturnValue_7, double CallFunc_Divide_DoubleDouble_ReturnValue_8, double K2Node_Select_Default_9, double CallFunc_Multiply_DoubleDouble_ReturnValue_8, double K2Node_Select_Default_10, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_10, double CallFunc_Divide_DoubleDouble_ReturnValue_9, double CallFunc_Divide_DoubleDouble_ReturnValue_10, double K2Node_Select_Default_11, double K2Node_Select_Default_12, double CallFunc_Multiply_DoubleDouble_ReturnValue_9, double CallFunc_Multiply_DoubleDouble_ReturnValue_10, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_11, enum class EFrameAlignment Temp_byte_Variable_12, double K2Node_Select_Default_13, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_12, double CallFunc_BreakVector2D_X_6, double CallFunc_BreakVector2D_Y_6, bool CallFunc_Less_DoubleDouble_ReturnValue, double K2Node_Select_Default_14, double CallFunc_FClamp_ReturnValue);
};

}


